[
    {
        "_id": {
            "$oid": "53e166f92c243f694e1c5fd6"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:10.808-0400"
                },
                "ext_url": "http://www.huffingtonpost.com/2014/07/13/israel-gaza-evacuation-raid_n_5581540.html",
                "image": "http://i.huffpost.com/gen/1906668/thumbs/s-GAZA-EVACUATION-large.jpg",
                "text": "Palestinian families travel to a UN school in Gaza City to seek shelter after evacuating their homes north of the strip, on July 13, 2014. Israeli marines mounted a first ground assault on Gaza, further escalating a deadly six-day offensive hours after the UN Security Council unanimously called for a ceasefire. AFP PHOTO / THOMAS COEX (Photo credit should read THOMAS COEX/AFP/Getty Images) | THOMAS COEX via Getty Images\n\nGAZA CITY, Gaza Strip (AP) — Thousands of Palestinian residents of the northern Gaza Strip fled their homes on Sunday and sought safety in U.N. shelters, heeding warnings from the Israeli military about impending plans to bomb the area in the sixth day of an offensive against Hamas that has killed more than 160 people.\n\nThe fighting showed no signs of slowing, despite international calls for a cease-fire and growing concerns about the mounting civilian death toll in Gaza. U.S. Secretary of State John Kerry spoke to Israeli Prime Minister Benjamin Netanyahu and voiced U.S. \"readiness\" to help restore calm, while Egypt, a key mediator between Israel and Hamas, continued to work behind the scenes.\n\nU.N. Secretary-General Ban Ki-moon called for an immediate cease-fire in a statement issued late Sunday by his spokesman's office.\n\nBan \"strongly believes that it is in the interest of both sides that steps toward dangerous escalation be replaced with immediate measures to end the fighting, thus preventing further casualties and greater risks to regional peace and security,\" it said.\n\nBan condemned Hamas' indiscriminate firing of rockets against Israeli civilian targets as \"a violation of international law,\" it said. He abhorred \"the image of Israeli families hovering in shelters in fear of their children's safety\" and demanded \"an immediate cessation of these indecent attacks.\"\n\nAt the same time, the U.N. chief is \"deeply worried about the impact on Palestinian families of Israeli military action. Too many Palestinian civilians have been killed, and any Israeli ground offensive will undoubtedly increase the death toll and exacerbate civilian suffering in the Gaza Strip,\" it said.\n\nBan noted that despite the U.N. Security Council's demand for a cease-fire, \"the situation in and around the Gaza Strip appears to be worsening,\" it said.\n\nAmid the diplomacy, Israel said it was pushing forward with preparations for a possible ground invasion of Gaza. Thousands of troops have massed along the border in recent days.\n\n\"We don't know when the operation will end,\" Israeli Prime Minister Benjamin Netanyahu told his Cabinet on Sunday. \"It might take a long time.\" He said the military was prepared \"for all possibilities.\"\n\nIsrael launched the offensive last Tuesday in what it said was a response to heavy rocket fire out of Hamas-controlled Gaza. The military says it has launched more than 1,300 airstrikes, while Palestinian militants have launched more than 800 rockets at Israel. The Palestinian Health Ministry in Gaza says 166 people have been killed, including dozens of civilians. There have been no Israeli fatalities, though several people have been wounded, including a teenage boy who was seriously injured by rocket shrapnel Sunday.\n\nEarly Sunday, the Israeli air force dropped leaflets around the northern Gaza town of Beit Lahia ordering people to evacuate their homes. Israel says much of the rocket fire has come from the area, and overnight Sunday, the military carried out a brief ground operation on what it said was a rocket-launching site that could not be struck from the air. Four Israeli soldiers were lightly wounded before returning to Israel.\n\nThe U.N. refugee agency for Palestinians, UNRWA, said some 17,000 Palestinians had headed to special shelters set up in 20 United Nations schools in Gaza.\n\n\"The fact that in a span of almost a few hours, 10,000 people sought refuge in these 15 schools is an indication to the difficult situation on the ground,\" said Sami Mshasha, a UNRWA spokesman.\n\nSome raced by in pickup trucks, waving white flags. \"Once we received the message, we felt scared to stay in our homes. We want to leave,\" said one resident, Mohammed Abu Halemah.\n\nShortly before nightfall, Israel carried out a series of airstrikes in the northern Gaza town of Beit Lahia. Hamas' Al-Aqsa TV station reported four airstrikes in a 10-minute span, and a large plume of black smoke could be seen over the area from the Israeli border. There were no immediate reports of casualties.\n\nHamas, an Islamic militant group sworn to Israel's destruction, has remained defiant, and it continued to fire rockets into Israel throughout the day. It urged people in northern Gaza to stay in their homes and has so far rejected proposals for a cease-fire as unsatisfactory.\n\n\"They want us to put down our arms and leave the resistance,\" said Moussa Abu Marzouk, a top Hamas official, on his Facebook page. \"They started the battle, and we will stay on our land and fight to protect our future.\"\n\nDespite Israeli claims that it has inflicted heavy damage on the group, Hamas says it is largely unscathed, and Palestinian medics say most of the dead have been civilians.\n\nThe outbreak of violence follows the kidnappings and killings of three Israeli teenagers in the West Bank, the kidnapping and killing of a Palestinian teenager in an apparent revenge attack, and wide-ranging Israeli moves against Hamas militants and infrastructure in the West Bank. Hamas has demanded that hundreds of recently arrested activists be freed as part of a cease-fire.\n\nMany of the airstrikes have been on the homes of wanted Hamas militants, putting their families at risk. In an attack on Saturday, the target of one such airstrike, Gaza's police chief, survived, while 17 members of his extended family were killed.\n\nIsrael accuses Hamas of using Gaza's civilians as human shields, putting people in the densely populated territory in danger.\n\n\"The leadership of Hamas and the other organizations has chosen — at a time when they are using the population of Gaza as human shields — to hide underground, to flee abroad and to deliberately put civilians in the line of fire,\" Netanyahu said.\n\nDespite Israel's claims, the international community, including many of Israel's allies, have begun to express concerns about the growing civilian death toll.\n\nThe Israeli military said that one of the rockets fired by Gaza militants Sunday night \"hit an electricity infrastructure in Israel that supplied electricity to the Gaza Strip, causing a power outage to some 70,000 Gaza civilians.\"\n\nIn Vienna, Kerry spoke Sunday with Netanyahu and highlighted U.S. concerns about the \"escalating tensions,\" the State Department said.\n\nKerry \"described his engagement with leaders in the region to help to stop the rocket fire so calm can be restored and civilian casualties prevented, and underscored the United States' readiness to facilitate a cessation of hostilities,\" the State Department said.\n\nEgypt, meanwhile, said President Abdel Fattah el-Sissi spoke to the U.N. chief Ban Ki-moon. El-Sissi's spokesman quoted Ban as praising Egyptian efforts to halt the fighting and affirming that \"Egypt is the most capable party to effectively participate in reaching a calm between the two sides.\" Netanyahu's office declined comment on diplomatic efforts.\n\nOther countries were also involved. Germany's foreign minister said he would head to the region on Monday, while French President Francois Hollande tried to rally Arab and Muslim leaders to push for a cease-fire.\n\nHollande held telephone talks over the weekend with Turkish Prime Minister Recep Tayyip Erdogan and Tunisian President Moncef Marzouki.\n\nMarzouki spokesman Adnane Mancer said the French and Tunisian presidents agreed that Marzouki would try to talk to Hamas leaders and urge a cease-fire, while Hollande would try to do the same with other parties. A French presidential official said Hollande was talking to Israeli, Palestinian and other Arab officials.\n\nOn Sunday, Palestinians with foreign passports began leaving Gaza through the Erez border crossing. Israel, which cooperated in the evacuation, said 800 Palestinians living in Gaza have passports from countries including Australia, Britain and the U.S.\n\nRawan Mohanna, a 21-year-old chemistry major at the University of Texas, said she had arrived in Gaza with her family a month ago because her older sister was getting married to a Gazan.\n\nMohanna, who lives in Dallas, said her family is now returning to the U.S. with mixed feelings because her newlywed sister and other relatives were staying behind.\n\n\"It's bittersweet that we get to leave but they are still there and they can't get out,\" she said.\n\nOn Sunday night, Israel's military said rockets were fired at Israel from both Syria and Lebanon in separate incidents. There were no injuries or damage, but Israel fears militant groups along its northern frontier may try to open a second front. The rocket attacks were the second such barrage on Israel from its northern neighbors in recent days.\n\nThe Israeli military said it retaliated by shooting toward the source of fire.\n\nIn Egypt, security officials said they had foiled a new attempt to fire rockets at Israel by militants in the northern Sinai Peninsula which borders Israel.\n\nFederman reported from Jerusalem. Angela Charlton in Paris, Kirsten Grieshaber in Berlin, Ian Deitch and Yousur Alhlou in Jerusalem, Ibrahim Barzak in Amman, Jordan, and Mohammed Daraghmeh in Ramallah, West Bank, contributed reporting.",
                "title": "Israel Calls For North Gaza Evacuation After Raid",
                "updated_at": {
                    "$date": "2014-08-05T19:42:10.808-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:13.811-0400"
                },
                "ext_url": "http://www.nydailynews.com/news/world/israeli-airstrikes-hit-mosque-palestinian-death-toll-rises-120-article-1.1864196",
                "image": "http://static3.nydailynews.com/polopoly_fs/1.1864796.1405226584!/img/httpImage/image.jpg_gen/derivatives/article_970/israel-air-strike.jpg",
                "text": "The Israeli military, ignoring a United Nations call Saturday for a cease-fire, expanded its lethal Gaza Strip attacks and deployed ground troops into the Palestinian territory.\n\nIsraeli commandos destroyed a rocket-launching site in northern Gaza — marking the first ground attack in the current offensive.\n\nFour Israeli soldiers were injured in the raid, the military said. It was carried out by special forces and did not appear to be the beginning of a broad ground offensive.\n\nPalestinians in northern Gaza were ordered to evacuate the region “for their own safety” before Israel upped its offensive.\n\nThe UN Security Council unanimously urged Israel to halt its Gaza attacks as air strikes Saturday hit one mosque and killed 15 worshippers returning from evening prayers at another.\n\nCharities linked to Hamas, the group behind continued rocket attacks on Israel, were also blasted as the Palestinian death toll from the five-day attack rose to at least 140.\n\nThe Israeli military also said it unleashed retaliatory fire Saturday at Lebanon after that country’s military launched a pair of rocket attacks.\n\nLate Saturday, a strike on the house of a police commander killed at least 18 people, Palestinian officials said.\n\nThe 15-member Security Council issued a unanimous statement urging reinstatement of the November 2012 cease-fire that ended eight days of violence in the volatile region.\n\nRiyad Mansour, the Palestinian UN envoy, said he was hopeful the fighting would stop as soon as possible.\n\nThe Israeli military claimed hits on 1,100 targets since Tuesday in response to rocket attacks from Hamas forces in Gaza. Israeli officials insisted the bombed mosque in central Gaza was actually doubling as a site to conceal some of the 700 rockets blasted at their nation in the last five days.\n\nBut Hamas spokesman Husam Badran said the attack on the religious center “shows how barbaric this enemy is and how much it is hostile to Islam.”\n\nThe attack on the disabled center killed two women, and officials in the strip reported the dead include dozens of civilians. More than 900 people were also wounded, and the Israelis targeted homes supposedly used for military purposes.\n\nThe nephew of top Hamas leader Ismail Haniyeh was also killed in a strike near his home.\n\nIsraeli Defense Minister Moshe Yaalon was prepared for several more days of fighting.",
                "title": "Israeli military orders Palestinians in northern Gaza Strip to evacuate 'for their own safety' as death toll rises",
                "updated_at": {
                    "$date": "2014-08-05T19:42:13.811-0400"
                }
            }
        ],
        "title": "Israel orders evacuation in northern Gaza Strip"
    },
    {
        "_id": {
            "$oid": "53e167022c243f694e1c5fd7"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:15.860-0400"
                },
                "ext_url": "http://www.saudigazette.com.sa/index.cfm?method=home.regcon&contentid=20140715211569",
                "image": "",
                "text": "Palestinians look at damaged cars amid the rubble of destroyed buildings following an Israeli air strike on Monday in Gaza City. – AFP\n\n\n\n \n\n \n\n \n\n GAZA CITY — It’s the holy month of Ramadan, when people throughout the Muslim world meet with friends and family, buy presents for loved ones and break a day-long fast each evening amid colorful street scenes.\n\n \n\n But not in Gaza City, one of the world’s most densely populated cities. A ceaseless Israeli bombing campaign, with airstrikes every five minutes, has turned the frenetic hub of the Gaza Strip into a virtual ghost town, emptying streets, closing shops and keeping hundreds of thousands of people close to home where they feel safest from the bombs.\n\n \n\n In Gaza, residents remain torn between fear for their safety and sadness over the loss of a normal Ramadan, usually a time of deep spirituality leavened by great joy and celebration.\n\n \n\n “The situation is very bad and not usual at all,” housewife Umm Al-Abed said. “People in the month of Ramadan used to visit each other and go to buy things that are only sold during Ramadan. \n\n \n\n But now because of the atmosphere of war, people are afraid to go out and there are no salaries for anyone.”\n\n As she spoke, she searched in vain for open shops on Omar Mukhtar, one of the city’s main thoroughfares, where she had hoped to buy special foods for the holiday.\n\n \n\n “The economy is very bad and as you can see the shops are all closed and the people are all in their homes,” she said.\n\n \n\n In nearby Jabalya, 77-year-old Ibrahim Mahmoud Daoud looked on grimly as several young men from the neighborhood helped him sift through the rubble of his two-story home, leveled early Friday by a bomb dropped from an Israeli warplane. A father to eight — seven married daughters and an unmarried son — Daoud sounded defiant as he considered the latest violent round in the long-running struggle between Israel and Hamas.\n\n \n\n “We don’t need houses,” Daoud said. “What we need is a country. I wish I were a young man, so I could wear a suicide belt and go blow myself up in Tel Aviv.”\n\n \n\n Some quietly criticize Hamas. Abu Ali, a driver for his family business who identified himself only by his first names to avoid Hamas retribution, insisted that at least in his immediate neighborhood, the movement was widely reviled.\n\n \n\n “Everybody here hates Hamas,” he said. “But they’re too afraid to say so publicly. \n\n \n\n Our food comes from Israel but what we give them in return is rockets — rockets that don’t even make little holes in the ground.” – AP",
                "title": "Israeli bombing turns Gaza into ghost town",
                "updated_at": {
                    "$date": "2014-08-05T19:42:15.860-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:17.662-0400"
                },
                "ext_url": "http://nsnbc.me/2014/07/15/egypt-brokers-israeli-palestinian-ceasefire-time-to-cease-firing-ends-at-900-pm/",
                "image": "http://nsnbc.me/wp-content/uploads/2014/06/Al_Sisi_sisi_Egypt_TCP_YOUM7_Archive-300x150.jpg",
                "text": "nsnbc : A ceasefire brokered by Egypt on Monday could come into effect by 9:00 pm on Tuesday. Egypt brokered the ceasefire between Israel and the PLO Executive Committee. PA President Mahmoud Abbas urges other factions to accept. Whether the ceasefire could come into effect or not may depend on whether there is time enough to solve a number of complex issues within a very short time frame.\n\n\n\nThe Egyptian initiative came simultaneously with a meeting of the foreign ministers of the Arab League in the Egyptian capital Cairo on Monday. The office of Israeli Prime Minister Benjamin Netanyahu reports that:\n\nBoth U.S. Secretary of State John Kerry and German Foreign Minister Frank-Walter Steinmeier have become directly engaged in an attempt to help the ceasefire come into effect. The Israeli government threatened to launch a ground attack if the attempt to implement the ceasefire fails. Kerry as well as Steinmeier warned against a ground attack.\n\n\n\nAhmed el-Megdalany, a member of the Executive Committee of the PLO as saying that\n\nThe initiative urges all sides to end hostilities immediately. It was supposed to come into effect as early as possible from 9:00 am local Cairo time and gives both sides 12 hours to implement a halt to further attacks.\n\nOnce the proposal has been accepted by all parties, the proposal suggests, that a series of meetings with high-level delegations will be held in Cairo, followed by steps towards opening the borders to Gaza and lifting the siege.\n\nSo far, non of the sides ceased fire. Members of the PLO Executive Committee are likely to start talks with representatives of the Palestinian factions and the factions will have to discuss the ceasefire with their respective armed wings.\n\nHamas Divided ? Hamas spokesman Sami Abu Zuhri as saying that Hamas did not receive any official ceasefire proposal and that their demands must be met before they lay down their weapons. The armed wing of Hamas, the Izz-al Deen al-Qassam Brigades likened the ceasefire to a “surrender” and stressed that neither Hamas not other resistance groups had been involved in the negotiations. They would therefore continue their resistance against the Israeli aggression in Gaza.\n\nAnalysts repeatedly stressed that the faction within Hamas, that is dominated by Khaled Mashal, is working with a double agenda, that to a large degree is identical with regional interests of Qatar, Turkey and other core NATO member states, and in part Israel. Discussions between the PLO Executive Committee and Hamas and negotiations within Hamas and its respective factions and wings are complicated; time for reaching an agreement to ceasefire is short.\n\nWhat is the point? Ismail Haniyeh issued a statement on Monday, explaining Hamas’s grievances with Israel. Haniyeh was Hamas’ Prime Minister in the Gaza Strip until the creation of the unity-government, which he supports. Haniyeh stressed among others, that the blockade against Gaza must be lifted.\n\nThe in 2006, the expected lifetime without a chronic disease was 37.7 (95% CI 37.0 to 38.3) years and 32.5 (95% CI 31.9 to 33.2) years for 20-year-old men and women, respectively. By 2010, this had decreased by 1.6 years for men and increased by 1.3 years for women. These figures represent both the occupied territories and the Gaza Strip. The situation in the Gaza Strip is worse than the national average. Government employees in the Gaza Strip have not received any wages for over five months.\n\nIsmail Haniyeh stressed that the problem is not that of reaching a calm but that the problem is that of the blockade of Gaza, the starvation, and the lack of commitment to agreements.\n\nPalestinian Authority President and al-Fateh leader Mahmoud Abbas urged other factions to respond positively to the ceasefire. An actual end to hostilities depends on a number of complicated factors and time is short.\n\nHave the PLO Executive Committee representatives yet unannounced arguments that would convince Hamas representatives about at least a credible hope for reaching an end to the blockade and improve conditions in the Gaza Strip?\n\nWill these arguments be strong enough to convince all factions within Hamas? Does that include “certain elements” who tend to represent a double agenda that in part serves foreign interests too? And how would this agenda play in at this moment? In part, this implies the question whether Khaled Mashal and the strongly Qatar-influenced faction within Hamas that he represents can give guarantees to Egypt, which would allow Egypt to lax its security at the Gaza Strip and in the Sinai without risking the country’s security?\n\nOne question that also may come to play is whether Frank-Walter Steinmeier, as many analysts suspect, has a mandate to at least help pay some of the unpaid wages? It is a sensitive issue in Germany, and not out of a lack of solidarity with Palestinians?\n\nAnd will the U.S. Secretary of State present “solutions” which are as “incredible” as the U.S. sponsored “peace talks” under the supervision of the prominent Zionist lobbyist Martyn Indyk?\n\nAll of these and many more questions have most likely been discussed for days. They will be discussed under the added pressure of a possible end to hostilities, and none of the sides, will cease hostilities “at all costs”. The problem for Palestinians is that the “costs”, so far, is over 190 killed and over 1,200 injured. The costs in terms of Israeli lives so far? “Zero”. The time to ceasefire expires at 9:00 pm.",
                "title": "Egypt Brokers Israeli - Palestinian Ceasefire. Time to cease firing ends at 9:00 pm",
                "updated_at": {
                    "$date": "2014-08-05T19:42:17.662-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:21.790-0400"
                },
                "ext_url": "http://www.ctvnews.ca/world/egyptian-truce-plan-unravels-as-gaza-militants-fire-rockets-israel-resumes-air-strikes-1.1914135#ixzz37XqmSAwL",
                "image": "http://www.ctvnews.ca/polopoly_fs/1.1915276!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
                "text": "\n\n Karin Laub and Aron Heller, The Associated Press \n\n \n\n\n\nGAZA, Gaza Strip -- Israel resumed its heavy bombardment of Gaza on Tuesday and warned that Hamas \"would pay the price\" after the Islamic militant group rejected an Egyptian truce plan and instead unleashed more rocket barrages at the Jewish state.\n\nLate Tuesday, the military urged tens of thousands of residents of northern and eastern Gaza to leave their homes by Wednesday morning, presumable a prelude to air strikes there.\n\nRocket fire killed an Israeli man Tuesday, the first Israeli fatality in eight days of fighting. In Gaza, 197 people were killed and close to 1,500 wounded so far, Palestinian officials said, making it the deadliest Israel-Hamas confrontation in just over five years.\n\nThe Egyptian proposal, initially accepted by Israel, had been the first attempt to end the fighting.\n\nIt unraveled in less than a day, a sign that it will be harder than before to reach a truce. Hamas does not consider Egypt's current rulers -- who deposed a Hamas-friendly government in Cairo a year ago -- to be fair brokers.\n\nViolence is bound to escalate in coming days.\n\nHamas believes it has little to lose by continuing to fight, while a truce on unfavourable terms could further weaken its grip on the Gaza Strip, a territory it seized in 2007. Underscoring that position, Gaza militants fired more than 120 rockets and mortar rounds at Israel on Tuesday, during what Egypt had hoped would be a period of de-escalation.\n\nA particularly heavy barrage came around dusk, with more than 40 rockets hitting Israel in just a few minutes, including one that fell on an empty school. TV footage showed children cowering behind a wall in Tel Aviv's main square as sirens went off. An Israeli man in his 30s was killed near the Gaza border when he was delivering food to soldiers -- the first Israeli death.\n\nHamas' defiance prompted Israeli warnings. In an evening address aired live on TV, Prime Minister Benjamin Netanyahu said that after Hamas' rejection of the truce, Israel had \"no choice\" but to respond more forcefully.\n\n\"Hamas chose to continue fighting and will pay the price for that decision,\" he said. \"When there is no cease-fire, our answer is fire.\"\n\nAfter holding its fire for six hours, the Israeli air force resumed its heavy bombardment of Gaza, launching 33 strikes from midafternoon, the military said. In all, Israeli aircraft struck close to 1,700 times since July 8, while Gaza militants fired more than 1,200 rockets at Israel.\n\nNetanyahu said Israel would have liked to see a diplomatic solution, but would keep attacking until rocket fire stops and Hamas' military capabilities are diminished. The Israeli leader said he would \"widen and increase\" the campaign against Hamas, but it remains unclear if that will include a ground offensive.\n\nIsrael has warned it might send troops into Gaza and has massed thousands of soldiers on the border. However, entering Gaza would likely drive up casualties on both sides. Israel has hesitated in the past to embark on ground operations for fear of getting entangled in the densely populated territory of 1.7 million.\n\nLate Tuesday, the Israeli military told residents of the northern town of Beit Lahiya and the Gaza City neighbourhoods of Shijaiyah and Zeitoun in automated phone calls to leave their homes by early Wednesday.\n\nSami Wadiya, a resident of one of the areas likely to be targeted, said he would not leave his home. \"We know it's risky, but there are no secure places to go to,\" he said.\n\nIn Washington, State Department spokeswoman Jen Psaki said Israel has the right to defend itself, but that \"no one wants to see a ground war.\"\n\n\"Our effort remains focused on seeing if we can return to a cease-fire,\" she said.\n\nThe current round has been the deadliest since a major Israeli military offensive in the winter of 2008-09. The previous outbreak of cross-border violence, in 2012, eventually ended with the help of Egypt, at the time seen as a trusted broker by Hamas.\n\nHamas officials Tuesday rejected the current Egyptian plan as is, noting they weren't consulted by Cairo. Some portrayed the truce offer as an ultimatum presented to Hamas by Israel and Egypt.\n\nThe officials said the Egyptian plan offered no tangible achievements, particularly on easing the border blockade that has been enforced by Israel and Egypt to varying degrees since 2007. Egypt tightened the closure in the past year by shutting down smuggling tunnels that were crucial for Gaza's economy, pushing Hamas into a severe financial crisis.\n\n\"The siege on Gaza must be broken, and the people of Gaza should live freely like other people of the world,\" Moussa Abu Marzouk, a top Hamas official, told the Lebanese TV channel Al-Mayadeen. \"There should be a new equation so that we will not have a war on Gaza every two years.\"\n\nMushir al-Masri, a Hamas leader in Gaza, said the movement wants additional mediators and international guarantees of any deal.\n\n\"Mediation to end this aggression needs to come from different countries, and the guarantees should be given by different countries in order to commit the occupation (Israel) to what any future agreement might say,\" al-Masri said, without naming preferred brokers.\n\nQatar and Turkey, seen as more sympathetic to Hamas, have been involved behind the scenes, but it's not clear to what extent. The emir of Qatar visited Turkey for talks Tuesday with Turkish leaders.\n\nPalestinian President Mahmoud Abbas, Hamas' main political rival, was to meet Wednesday in Cairo with Egyptian President Abdel-Fattah el-Sissi and then fly to Turkey for high-level talks.\n\nBefore the latest fighting, Abbas had reached a tentative unity deal with Hamas that would have given him a new foothold in Gaza. However, a significant easing of the Gaza blockade in a truce deal would revitalize Hamas, make it less dependent on Abbas and possibly scuttle the unity agreement.\n\nAbbas and his Western-backed Palestinian Authority have largely been sidelined in the past week, unable to change the course of events.\n\nHamas' popularity tends to rise when it fights Israel, usually at the expense of Abbas, who continues to advocate negotiating a deal with Israel on Palestinian statehood.\n\nThe Palestinian Authority's health minister, Jawad Awwad, who had travelled to Gaza to deliver medicine to the territory's largest hospital, was chased off by stone throwers. Hamas officials later apologized to him.\n\nIn Israel, there was also domestic political fallout.\n\nNetanyahu is under a lot of pressure from hawks in his Cabinet and the ruling Likud Party to launch a ground offensive to put an end to the rocket fire. He faced blistering criticism from the right over initially agreeing to the Egyptian truce plan.\n\nForeign Minister Avigdor Lieberman called a news conference in which he said Israel should not hesitate and \"go all the way.\" He said the operation should conclude with the Israeli military controlling all of the Gaza Strip.\n\nNetanyahu, meanwhile, fired Deputy Defence Minister Danny Danon, one of his fiercest critics who didn't tone down his rhetoric during the offensive. Netanyahu said that by attacking the government at a time of war, Danon played into the hands of Hamas.",
                "title": "Israel resumes Gaza bombings after Hamas continues rocket barrages",
                "updated_at": {
                    "$date": "2014-08-05T19:42:21.790-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:23.257-0400"
                },
                "ext_url": "http://www.foxnews.com/world/2014/07/15/israel-cabinet-approves-gaza-cease-fire-egypt-offer/",
                "image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/876/493/071514_HN_Hamas_640.jpg?ve=1&tl=1",
                "text": "An Israeli man delivering food to soldiers Tuesday at the border of the Gaza Strip was struck and killed by mortar fire, becoming the first Israeli death in more than a week of fighting between the country’s army and Hamas militants.\n\nPolice spokesman Micky Rosenfeld told The Associated Press that the man, in his 30s, was at the Erez Crossing with the Gaza Strip.\n\nThe news of the death came around the same time Israeli Prime Minister Benjamin Netanyahu vowed to exert \"great force\" against Gaza's Hamas rulers after the Islamic militants rejected a truce agreement.\n\nIn a televised address, Netanyahu said \"Hamas chose to continue fighting and will pay the price for that decision.\"\n\nGaza militants fired close to 100 rockets since the morning, when the truce was to have begun, the Israeli military said. In the evening, a quick barrage of 40 rockets fell over the course of a few minutes. Palestinian health officials say 194 Palestinians were killed and more than 1,400 over the past week.\n\nIsraeli officials said that the truce proposed by Egypt's Foreign Ministry had been accepted by the cabinet shortly after it was due to take effect Tuesday at 9 a.m. local time (2 a.m. Eastern Time). Less than half an hour later, a senior Hamas official told The Associated Press that the group had rejected the proposal, claiming that Cairo had not consulted them.\n\n\"We did not receive any official draft of this Egyptian proposal,\" Sami Abu Zuhri said, adding that the plan, as is, was \"not acceptable.\"\n\nIsrael’s military later said it resumed airstrikes on the Gaza Strip Tuesday after Hamas continued to fire rockets throughout the country.\n\nIsraeli Prime Minister Benjamin Netanyahu and Defense Minister Moshe Yaalon \"directed the military to act with intensity against terror targets in Gaza,\" said an Israeli official who spoke on condition of anonymity because he was not authorized to discuss the decision with the media.\n\nA senior Israeli military official suggested the Egyptian plan hadn't collapsed entirely.\n\nHe said that even though Israel resumed bombing Gaza, it would stop if Hamas accepts the truce and that the coming hours are critical. If not, the military has a plan in place to significantly amp up its offensive, including a possible ground operation, said the official who spoke on condition of anonymity because he was discussing military strategy.\n\nOn Tuesday evening, rocket sirens and blasts were heard in Tel Aviv, as Israel's \"Iron Dome\" missile defense system intercepted two rockets, according to the Israel Defense Forces Twitter account.\n\nIn addition, the military said three rockets were fired at the southern city of Eilat. The military did not immediately know who was behind the rocket fire. Previous rocket attacks on the city have come from radical Islamic militants in the neighboring Sinai Peninsula.\n\nUnder the Egyptian plan, proposed late Monday, a 12-hour period of de-escalation was to begin at mid-morning Tuesday. Once both sides agree to halt hostilities, they would negotiate the terms of a longer-term truce.\n\nBut the armed wing of Hamas said the Egyptian plan \"wasn't worth the ink it was written with.\" Reuters reported that a statement on the website of the al-Qassam Brigades called the proposal \"an initiative of kneeling and submission\" before vowing that \"our battle with the enemy continues, and will increase in ferocity and intensity.\"\n\nWord of Hamas' rejection of the cease-fire came hours after State Department officials told The Associated Press that Secretary of State John Kerry had opted not to travel to the region on his way back to Washington from talks regarding Iran's nuclear program in Vienna. There was no immediate word of whether Kerry would reconsider his decision in light of the cease-fire's rejection.\n\nThe militant group appeared to be holding out for better cease-fire conditions, with senior officials saying the current proposal offers no tangible achievements, particularly on easing a border blockade of Gaza enforced by Israel and Egypt.\n\nOsama Hamdan, a key aide to top Hamas leader Khaled Mashaal, told The Associated Press that Hamas has a series of demands, including the release of Hamas activists arrested by Israel in the West Bank in recent weeks. Hamas also wants to be recognized by Egypt as a partner in any truce efforts.\n\nAnother Hamas official, Moussa Abu Marzouk, sounded more conciliatory, saying internal consultations on the cease-fire proposal are continuing.\n\nHamas officials are weary of promises by Egypt and Israel to ease the border blockade. Such promises were also part of a truce that ended more than a week of fighting in 2012, but were quickly broken as violence flared again.\n\nAn easing of the blockade of the coastal strip is key to the survival of Hamas.\n\nBefore the outbreak of the latest round of fighting, the militant group found itself in a serious financial crisis because a particularly tight closure by Egypt had prevented cash and goods from coming into the strip through hundreds of smuggling tunnels under the Gaza-Egypt border.\n\nIsrael launched an offensive July 8, saying it was a response to weeks of heavy rocket fire out of Hamas-ruled Gaza.\n\nAhead of the Egyptian announcement, there appeared to be no slowdown in the fighting, with Hamas for the first time launching an unmanned drone into Israeli airspace that was shot down.\n\nThe violence followed the kidnappings and killings of three Israeli teenagers in the West Bank last month, as well as the subsequent kidnapping and killing of a Palestinian teenager in an apparent revenge attack, along with Israeli raids against Hamas militants and infrastructure in the West Bank.\n\nIsraeli officials have said the goal of the military campaign is to restore quiet to Israel's south, which has absorbed hundreds of rocket strikes, and that any cease-fire would have to include guarantees of an extended period of calm. Hamas officials say they will not accept \"calm for calm.\"\n\nWith the death toll mounting, both sides have come under increasing international pressure to halt the fighting.\n\nThe Associated Press contributed to this report.",
                "title": "First Israeli killed by Gaza rocket fire as Netanyahu vows to exert 'great force' against Hamas",
                "updated_at": {
                    "$date": "2014-08-05T19:42:23.257-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:24.676-0400"
                },
                "ext_url": "http://edition.cnn.com/2014/07/15/world/meast/hamas-leaders-whos-who/index.html",
                "image": "http://i2.cdn.turner.com/cnn/dam/assets/140729174528-hamas-gunman-getty-story-top.jpg",
                "text": "(CNN) -- They call themselves \"the resistance.\"\n\nIsrael and the United States call them terrorists.\n\nWhat's unclear is who's calling the shots within the Palestinian militant group Hamas.\n\nThe political and the military arms of the group appear to have contrasting mission statements, and analysts say it's hard to pin down precisely who has the final word on making decisions and guiding strategy.\n\nHe's Hamas' top political leader and often its public face. He's had the role since 2004 after Hamas' then-leader, Abdel Aziz al-Rantissi, was killed in an Israeli airstrike.\n\nA former teacher, Meshaal operates mostly from Qatar and is known as Hamas' external deal-maker, raising money from supporters in the region.\n\n\"Despite his George Clooney-type looks, he's very much a dangerous man because he aids and abets Hamas' very destructive policies and strategy,\" said Neri Zilber of the Washington Institute for Near East Policy.\n\nWhile it's not clear how much control Meshaal has over the military wing of the group, one Israeli official calls the 58-year-old \"the Osama bin Laden of Hamas.\"\n\nA bizarre assassination plot: In 1997, Meshaal was the target of a bizarre assassination attempt by the Mossad, Israel's intelligence service.\n\nMossad agents confronted Meshaal in Jordan and injected or sprayed poison into his ear.\n\nIt might have ended right there. But Jordan's King Hussein, who had a peace treaty with Israel, threatened to break off relations unless Mossad delivered the antidote to the poison. And they did.\n\n\"Allah saved me. Then King Hussein,\" Meshaal told CNN in 2002.\n\nA $70 million budget: In 2012, Meshaal left his previous base of operations in Syria as the country's civil war deepened. That decision is believed to have led to a breakdown in his relationship with Iran, Hamas' key backer, said Firas Abi Ali, head of Middle East and North Africa Country Risk and Forecasting at IHS.\n\n\"The Qataris, who are backing him now, are not able to provide the military expertise and training on rockets and drones that the military wing needs to fight Israel,\" he said. \"These are things that only the Iranians can provide.\"\n\nBut there are other members who still enjoy the support of Iran. And, as Meshaal told CNN's Christiane Amanpour, Hamas enjoys the support of expatriate Palestinians, private donors in the Middle East and Muslim charities -- enough to bankroll its $70 million annual budget.\n\n\"Hamas -- as a movement of resistance, with a cause, for a people living under occupation -- we seek, not just wait, to get support, financial support, military support, political support from all over the world, from all the states in the world,\" he said. \"Everyone giving us support, whether it's from Iran or Europe, from anywhere.\"\n\nHamas formed in 1987 at the start of the first Palestinian intifada, or uprising, as an Islamic resistance movement against Israel. In 2006, Hamas won a majority in Palestinian legislative elections and formed a unity government with its rival Fatah. But the coalition collapsed into deadly violence in 2007, leaving Hamas in control of Gaza and the Fatah-dominated Palestinian Authority in power in the West Bank.\n\nDuring Hamas' short-lived coalition with Fatah, Haniyeh became Prime Minister of the Palestinian Authority. After their 2007 split, he retained the role for Hamas in Gaza.\n\nThe group's second political leader is Mousa Abu Marzouk.\n\nIn Iran's good books: Haniyeh is a former leader of Hamas' student movement. He was considered to be a close associate of the group's founder and spiritual leader, Sheikh Ahmed Yassin, according to the Council on Foreign Relations. Yassin was assassinated by an Israeli airstrike as he was leaving a Gaza City mosque in 2004.\n\n\"The faction in Gaza led by Ismail Haniyeh and Mousa Abu Marzouk appears to still be in Iran's good books,\" said Abi Ali. \"It still has good relations with Iran, given the increased sophistication of rockets used by Hamas and Islamic Jihad.\"\n\nHaniyeh and Abu Marzouk are believed to operate between Egypt and Gaza.\n\nBut the Egyptian government has made movement between Egypt and Gaza a lot harder for Hamas leaders.\n\n\"The siege has led the Gaza-based factions to band together,\" Abi Ali said. \"They're more coherent and cohesive.\"\n\nGoodwill among the people: Part of the pair's job is to ensure that Hamas continues to enjoy widespread backing from the general population in Gaza. The group does it through its many social welfare programs.\n\nAccording to the Council on Foreign Relations, \"(its) efforts in this area -- as well as a reputation for honesty, in contrast to the many Fatah officials accused of corruption -- help to explain its broad popularity.\"\n\nSince Hamas took over Gaza, the armed wing, Qassam Brigades, has morphed into a military force aimed at protecting the territory. Its fighters have also continued to periodically fire rockets into Israel. The Israeli military estimated this month that Hamas and other militant groups in Gaza have between them roughly 10,000 rockets of varying ranges.\n\nThe military wing is led by Mohammed Dief, a shadowy, savvy figure who analysts say has survived multiple Israeli assassination attempts.\n\nAlways on the move: The Qassam Brigades' website says that Dief's real name is \"Mohammed Diab.\" It says he took the name \"Dief,\" which means \"guest,\" because under the pursuit of Israeli security forces, \"he kept moving from village to village and from place to place.\"\n\nDief was wounded years ago and is believed to have handed some operational parts of his role to other top Hamas military leaders like Marwan Issa.\n\n\"Over the years, it's lost a lot of military commanders during assassinations and military conflicts,\" said Abi Ali. \"It's proven that it's robust enough to take this kind of event and keep improving its capability.\"\n\nMarwan Issa's forte is believed to be unconventional attacks on Israel.\n\n\"It could be these kidnapping or offensive-type operations through attack tunnels underneath the Gaza border inside Israel,\" Zilber said.\n\nThe Qassam Brigades also said it has sent several drones on missions inside Israel. The Israel Defense Forces said it shot down a drone off the country's coast on Monday.\n\n\"What we are seeing in this conflict is the military wing asserting itself as the one in control,\" said Abi Ali.\n\nAlways a target: And it's that kind of tactic that may, according to analysts, have made Issa one of Israel's chief targets in its offensive. In 2006, he survived an Israeli military assassination attempt. This month, his house was targeted in Israeli airstrikes. He's believed to be in hiding elsewhere.\n\nAl Arouri is the head of the Qassam Brigades in the West Bank, and he is accused of catalyzing this latest conflict. Israeli officials say he's the person who ordered the abduction of the three Israeli teens, whose bodies were later found in a field in the West Bank. \"Al Arouri, who used to live in a village north of Ramallah, has urged West Bank operatives incessantly to set up terror cells and perpetrate kidnappings,\" The Times of Israel reported last month, quoting an Israeli security official.\n\nSitting safe in Turkey: Last month, Israeli military demolished what is believed to be Al Arouri's home in the West Bank. But he wasn't there. His base of operation is Turkey, where he's safe from the reaches of the Israeli forces. Turkey cut all diplomatic relations with Israel after commandos boarded a boat carrying supplies to Gaza and killed nine people in 2010.\n\nAct of desperation: So, who exactly is in charge?\n\n\"None of these movements are monoliths,\" said Abi Ali.\n\nStill, he said, \"what we are seeing in this conflict is the military wing asserting itself as the one in control.\"\n\nKhaled Elgindy, who was a former adviser to the Palestinian authority, said Hamas is in one of the weakest positions it's been in in several years.\n\n\"The changes that have happened in the region and especially in Egypt; their closure of the tunnels and its access to finances and weapons have been severely diminished over the last year in particular. So they're in a much weaker position,\" he said.\n\nAnd that weakened position, he says, is fueling the military wing's belligerence.\n\n\"I think part of the motivation for sort of, you know, taking the Israeli bait, if you will, in this latest round of violence has been, I think, the fact that they're in a state of disarray and, you know, in a way I think it's an act of desperation by a very weak Hamas.\"\n\nCNN's Tim Lister and Bryony Jones contributed to this report.",
                "title": "Gaza crisis: Who's who in Hamas",
                "updated_at": {
                    "$date": "2014-08-05T19:42:24.676-0400"
                }
            }
        ],
        "title": "Hamas leadership refuses Egyptian cease fire initiative"
    },
    {
        "_id": {
            "$oid": "53e167172c243f694e1c5fd8"
        },
        "articles": [],
        "title": "Concerns over harm to Gaza Strip citizens due to collapse of cease fire"
    },
    {
        "_id": {
            "$oid": "53e167382c243f694e1c5fd9"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:42:59.817-0400"
                },
                "ext_url": "http://www.telegraph.co.uk/news/worldnews/europe/ukraine/10974050/Malaysia-Airlines-plane-crashes-on-Ukraine-Russia-border-live.html",
                "image": "http://i.telegraph.co.uk/multimedia/archive/02982/flight-trader-mh4__2982104c.jpg",
                "text": "• MH17 plane crash: latest news • Foreign ministers agree more 'forceful' sanctions • Hollande aide: UK 'hypocrite' to call for French sanctions • British investigators to retrieve data from plane's black boxes • Train carrying remains of 282 people arrives in Kharkiv\n\n00.00 Thanks for joining us. Follow the latest updates back here tomorrow morning\n\n21.20 The euro fell to its lowest point this year against the dollar amid fear the downing of the jet will further damage EU-Russia relations, AP reports.",
                "title": "Malaysia Airlines plane crashes on Ukraine-Russia border: July 22 as it happened",
                "updated_at": {
                    "$date": "2014-08-05T19:42:59.817-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:01.911-0400"
                },
                "ext_url": "http://www.theguardian.com/world/2014/jul/17/malaysia-airlines-plane-crash-east-ukraine",
                "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/17/1405616327238/Malaysia-Airlines-Boeing--011.jpg",
                "text": "A Malaysia Airlines passenger jet carrying 295 people from Amsterdam to Kuala Lumpur has crashed in an area of eastern Ukraine where separatist rebels have been engaging Ukrainian military forces in recent weeks. Ukraine's president, Petro Poroshenko, said the jet may have been shot down.\n\n\"We do not exclude that the plane was shot down and confirm that the Ukraine armed forces did not fire at any targets in the sky,\" Poroshenko said in a statement.\n\nThe field next to the tiny rural hamlet where MH17 plunged to the ground was a scene of charred earth and twisted metal. Locals were distressed to find body parts scattered around the scene. The body of what appeared to be a young woman lay about 500 metres from the centre of the crash, while a dismembered foot could be seen on the one road leading through the village.\n\nA strong smell of aviation fuel hung in the air as pro-Russian separatist fighters attempted to secure the area. Ten fire engines remained on the scene after rushing there to extinguish the many blazes caused by the crash.\n\nOne local resident, Alexander, said he was working in the field a few hundred metres from its final resting place when he looked up. He feared the aircraft was going to crash on him.\n\nThe house in which another local, also named Alexander, and his relative, Olga, live in was just metres from the crash site. They said they thought the village was being bombed after hearing two or three loud bangs before the force of the impact threw them to the ground.\n\nIn a statement, Malaysia Airlines said Ukraine's air traffic control lost contact with flight MH17 at 2.15pm GMT, approximately 30 miles from the Russia-Ukraine border.\n\n\"Flight MH17, operated on a Boeing 777, departed Amsterdam at 12.15pm [Amsterdam time] and was estimated to arrive at Kuala Lumpur international airport at 6.10am [Malaysia time] the next day. The flight was carrying 280 passengers and 15 crew.\" The flight also had a Dutch airline flight number from KLM, KL4103.\n\nAnton Gerashchenko, an adviser to Ukraine's interior minister, wrote on his Facebook page that the plane had crashed in Ukrainian territory after being hit by a missile fired from a Buk launcher. Associated Press said one of its journalists had seen a similar launcher near the town of Snizhne earlier on Thursday.\n\nLeaders of the self-declared Donetsk people's republic denied any involvement, according to Interfax news agency. A member of the republic's security council said rebel weapons only had the capacity to shoot down a plane at 3,000 metres and blamed Ukrainian military forces for the attack.\n\nPoroshenko called for a commission to be set up to investigate the crash. \"This is the third tragic incident in recent days after Ukrainian military An-26 and Su-25 jets were shot down from Russian territory. We don't rule out that this plane was also shot down, and we stress that the Ukrainian military didn't take any actions to destroy targets in the air,\" he said.\n\nEarlier on Thursday, Ukraine accused Russia of downing one of its fighter jets inside Ukrainian territory.\n\nDmitry Peskov, a spokesman for the Russian president, Vladimir Putin, called allegations that Russia had been involved in the downing of MH17 \"stupidity\". Peskov told the Guardian that the Kremlin would not make a further statement on the tragedy because \"no one knows\" who is responsible.\n\nAsked about the possibility of further US sanctions in light of this bloody development in the conflict in eastern Ukraine, Peskov said he could not rule it out.\n\n\"The United States has recently been conducting a very non-constructive policy, and their actions are very unpredictable,\" he said.\n\nSpeaking in Delaware, Barack Obama said that the incident \"looks like it may be a terrible tragedy\", adding that his top priority was to find out whether American citizens were on board. \"I've directed my national security team to stay in close contact with the Ukrainian government. The United States will offer any assistance we can to help determine what happened and why. As a country, our thoughts and prayers are with all the families of the passengers, wherever they call home.\"\n\nEarlier, Obama and Putin spoke on the phone about new US sanctions imposed on Moscow over its alleged failure to halt the flow of weapons and fighters to separatist forces in eastern Ukraine.\n\nSeveral airlines, including British Airways, Aeroflot, Turkish Airlines and Russia's Transaereo, announced that they would avoid Ukrainian airspace with immediate effect. Lufthansa said it would steer clear of airspace over eastern Ukraine.\n\nAt least 30 Dutch-speaking passengers were on the plane, according to two travel agencies which sold tickets for the flight. According to Dutch newspaper websites, several Dutch passports were found near the scene of the crash.\n\nThe Malaysian prime minister, Najib Razak, said via Twitter: \"I am shocked by reports that an MH plane crashed. We are launching an immediate investigation.\"\n\nThe country's defence minister tweeted that he was \"monitoring closely\" claims that MH17 had crashed, saying: \"No comfirmation [sic] it was shot down! Our military have been instructed 2 get on it!\"\n\nThe crash comes four months after Malaysia Airlines flight MH370 vanished on a flight from Kuala Lumpur to Beijing with 239 people on board, two-thirds of them Chinese citizens. It has yet to be found despite a massive international search, which is ongoing, but Malaysia Airlines has said it believes everyone on board died when the plane crashed into the southern Indian Ocean.\n\nThat aircraft was a Boeing-777 – the same kind of plane as flight MH17. In 2001, Ukraine admitted that its military was probably responsible for shooting down a Russian airliner that crashed into the Black Sea, killing all 78 on board. A senior Ukrainian official said it had most likely been downed by an accidental hit from an S-200 rocket fired during exercises.\n\nIn 1983, a Soviet jet fighter shot down a South Korean airliner after it veered off course into Russian air space and failed to respond to attempts to make contact. All 269 passengers and crew were killed.\n\nIn 1988, the US warship Vincennes shot down an Iranian airliner over the Gulf, killing all 290 passengers and crew, in what the United States said was an accident after crew mistook the plane for a fighter. Tehran called it a deliberate attack.",
                "title": "Malaysia Airlines flight MH17 crashes in east Ukraine",
                "updated_at": {
                    "$date": "2014-08-05T19:43:01.911-0400"
                }
            }
        ],
        "title": "Malaysian Airlines Flight MH17 crashes near Torez, Ukraine"
    },
    {
        "_id": {
            "$oid": "53e1673e2c243f694e1c5fda"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:02.828-0400"
                },
                "ext_url": "http://www.eurekalert.org/pub_releases/2014-07/miot-gag071714.php",
                "image": "http://media.eurekalert.org/multimedia_prod/pub/rel/76373_rel.jpg",
                "text": "CAMBRIDGE, MA -- Twisting a screwdriver, removing a bottle cap, and peeling a banana are just a few simple tasks that are tricky to pull off single-handedly. Now a new wrist-mounted robot can provide a helping hand \u0097 or rather, fingers.\n\nResearchers at MIT have developed a robot that enhances the grasping motion of the human hand. The device, worn around one's wrist, works essentially like two extra fingers adjacent to the pinky and thumb. A novel control algorithm enables it to move in sync with the wearer's fingers to grasp objects of various shapes and sizes. Wearing the robot, a user could use one hand to, for instance, hold the base of a bottle while twisting off its cap.\n\n\"This is a completely intuitive and natural way to move your robotic fingers,\" says Harry Asada, the Ford Professor of Engineering in MIT's Department of Mechanical Engineering. \"You do not need to command the robot, but simply move your fingers naturally. Then the robotic fingers react and assist your fingers.\"\n\nUltimately, Asada says, with some training people may come to perceive the robotic fingers as part of their body \u0097 \"like a tool you have been using for a long time, you feel the robot as an extension of your hand.\" He hopes that the two-fingered robot may assist people with limited dexterity in performing routine household tasks, such as opening jars and lifting heavy objects. He and graduate student Faye Wu presented a paper on the robot this week at the Robotics: Science and Systems conference in Berkeley, Calif.\n\nThe robot, which the researchers have dubbed \"supernumerary robotic fingers,\" consists of actuators linked together to exert forces as strong as those of human fingers during a grasping motion.\n\nTo develop an algorithm to coordinate the robotic fingers with a human hand, the researchers first looked to the physiology of hand gestures, learning that a hand's five fingers are highly coordinated. While a hand may reach out and grab an orange in a different way than, say, a mug, just two general patterns of motion are used to grasp objects: bringing the fingers together, and twisting them inwards. A grasp of any object can be explained through a combination of these two patterns.\n\nThe researchers hypothesized that a similar \"biomechanical synergy\" may exist not only among the five human fingers, but also among seven. To test the hypothesis, Wu wore a glove outfitted with multiple position-recording sensors, and attached to her wrist via a light brace. She then scavenged the lab for common objects, such as a box of cookies, a soda bottle, and a football.\n\nWu grasped each object with her hand, then manually positioned the robotic fingers to support the object. She recorded both hand and robotic joint angles multiple times with various objects, then analyzed the data, and found that every grasp could be explained by a combination of two or three general patterns among all seven fingers.\n\nThe researchers used this information to develop a control algorithm to correlate the postures of the two robotic fingers with those of the five human fingers. Asada explains that the algorithm essentially \"teaches\" the robot to assume a certain posture that the human expects the robot to take.\n\nFor now, the robot mimics the grasping of a hand, closing in and spreading apart in response to a human's fingers. But Wu would like to take the robot one step further, controlling not just position, but also force.\n\n\"Right now we're looking at posture, but it's not the whole story,\" Wu says. \"There are other things that make a good, stable grasp. With an object that looks small but is heavy, or is slippery, the posture would be the same, but the force would be different, so how would it adapt to that? That's the next thing we'll look at.\"\n\nWu also notes that certain gestures \u0097 such as grabbing an apple \u0097 may differ slightly from person to person, and ultimately, a robotic aid may have to account for personal grasping preferences. To that end, she envisions developing a library of human and robotic gesture correlations. As a user works with the robot, it could learn to adapt to match his or her preferences, discarding others from the library. She likens this machine learning to that of voice-command systems, like Apple's Siri.\n\n\"After you've been using it for a while, it gets used to your pronunciation so it can tune to your particular accent,\" Wu says. \"Long-term, our technology can be similar, where the robot can adjust and adapt to you.\"\n\nDown the road, Asada says the robot may also be scaled down to a less bulky form.\n\n\"This is a prototype, but we can shrink it down to one-third its size, and make it foldable,\" Asada says. \"We could make this into a watch or a bracelet where the fingers pop up, and when the job is done, they come back into the watch. Wearable robots are a way to bring the robot closer to our daily life.\"\n\n\n\nAAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert! system.",
                "title": "Getting a grip on robotic grasp",
                "updated_at": {
                    "$date": "2014-08-05T19:43:02.828-0400"
                }
            }
        ],
        "title": "MIT researchers develop wrist-mounted robot that enhances grasping motion of human hand"
    },
    {
        "_id": {
            "$oid": "53e167402c243f694e1c5fdb"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:04.325-0400"
                },
                "ext_url": "http://bigstory.ap.org/article/why-airlines-didnt-avoid-risky-ukraine-airspace",
                "image": "",
                "text": "The shooting down of a Malaysian Airlines plane with nearly 300 people on board over war-torn eastern Ukraine is likely to have profound consequences for the world's airlines.\n\nAirlines are already being more vigilant about avoiding trouble spots. That will make flights longer and more costly because of the need for extra fuel — an expense that will be passed on to passengers. They may be quicker to abandon routes near conflict areas.\n\nIn the aftermath of Thursday's disaster, carriers around the globe rerouted flights to avoid Ukraine. Malaysia Airlines announced that it will no longer fly over any portion of the country, routing flights over Turkey instead.\n\nSome airlines had been circumventing the country for weeks after warnings from aviation authorities, and experts questioned Malaysia's decision to fly near the fighting.\n\n\"I find it pretty remarkable that a civil airline company — if this aircraft was on the flight plan — that they are flight-planning over an area like that,\" said Robert Francis, a former vice chairman of the National Transportation Safety Board.\n\nThe airline noted Friday that other carriers flew the same path in the days and weeks before — and even on the same day its plane was shot down. Malaysian Transport Minister Liow Tiong Lay insisted again Friday that the airline's path from Amsterdam to Kuala Lumpur was an internationally approved route.\n\nViolence in Ukraine between government forces and pro-Russia rebels in the country's east erupted after Russia annexed Ukraine's Crimean Peninsula in March. Earlier this week, the rebels claimed responsibility for hitting a Ukrainian military jet with a portable surface-to-air missile; the pilot was able to land safely. And the government charged that a military transport plane was shot down by a missile fired from Russian territory.\n\nThe U.S. Federal Aviation Administration had warned pilots in April not to fly over parts of Ukraine, and the U.N.'s International Civil Aviation Organization told governments to warn their airlines. Thursday's crash, however, occurred outside those warning areas, prompting the FAA to expand its prohibition to eastern Ukraine.\n\nThomas Routh, an aviation attorney in Chicago, said it would be unusual for an airline to ignore such warnings, but he said there are many dangerous air corridors and airlines must decide whether a flight will be safe.\n\n\"There are airlines flying through Afghanistan airspace every day,\" Routh said.\n\nGreg Raiff, an aviation consultant in New Hampshire, said that if airlines must avoid all the world's hot spots, flight times would be extended, requiring extra fuel and pilots. Some routes will become uneconomical, forcing airlines to abandon them, he said.\n\nAviation experts said that many airlines continued to fly over Ukraine despite the warnings because it offered a shorter route that saved fuel. Malaysian officials denied that was their motive.\n\nJoshua Marks, CEO of aviation-data firm masFlight, calculated that flying over Ukraine instead of around the country saved Malaysia Airlines up to $1,500 per flight in fuel, or 2 percent, and shaved about 10 minutes off the trip.\n\nUkraine closed the eastern region to air traffic below 26,000 feet on July 1 and extended the ban to 32,000 feet on Monday. An official with Eurocontrol, a consortium of European air traffic agencies, said about 350 planes had been flying over the area every day before the restrictions, but that had dropped by about one-fourth before Thursday's crash.\n\nBy Friday, snapshots from flight-tracking services showed dense traffic to the west of Ukraine, light traffic over western Russia, and very few planes over Ukraine.\n\nDubai-based Emirates airlines suspended flights to Kiev indefinitely. Germany's Lufthansa rerouted trips to avoid eastern Ukraine, although flights to Kiev and Odessa were unaffected. Atlanta-based Delta Air Lines said that it would stop flying over any part of the country. India's aviation agency said Air India and Jet Airways would also avoid Ukraine.\n\nSome airlines had already changed their routes.\n\nAustralia's Qantas stopped flying over Ukraine several months ago and shifted its London-Dubai route 645 kilometers (400 miles) to the south. A spokeswoman declined to explain the change. Korean Air said it rerouted cargo and passenger flights in early March as the situation in Crimea deteriorated.\n\nBeyond Ukraine, Emirates recently stopped flying over parts of Syria as a civil war expanded. Some airlines have curtailed service in Iraq, where violence has escalated between the government and a jihadist militant group. The FAA has current warnings about flying over parts of Iran, Yemen, Egypt's Sinai peninsula, North Korea and other countries.\n\nLast month, a gunman in Pakistan fired on a jetliner that was landing in Peshawar, part of the country's volatile northwest region, killing a passenger and wounding two other people. Emirates suspended flights to Peshawar, and other carriers canceled some flights while they reviewed airport security. Two weeks before that, gunmen attacked the country's busiest airport in Karachi.\n\nSagar Meghani in Washington, John-Thor Dahlburg in Brussels and Frank Jordans in Berlin contributed to this report.",
                "title": "Why airlines didn't avoid risky Ukraine airspace",
                "updated_at": {
                    "$date": "2014-08-05T19:43:04.325-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:05.393-0400"
                },
                "ext_url": "http://www.theguardian.com/world/2014/jul/18/ukraine-mh17-malaysia-airlines-jet-missile",
                "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/18/1405674980217/Malaysia-Airlines-MH17-pl-011.jpg",
                "text": "Ukraine's foreign minister says there is no chance that the missile apparently used to shoot down a Malaysia Airlines jet over the east of the country was of Ukrainian military origin.\n\nPavlo Klimkin told the Guardian on Friday morning that the Ukrainian army did not have such missiles in the area, and said none had been seized by separatist fighters in recent weeks.\n\n\"We are absolutely sure and we checked yesterday that no missiles have been taken from the Ukrainian army,\" said Klimkin.\n\nMH17 crashed near the village of Grabovo on Thursday killing all of its nearly 300 passengers and crew. US authorities say they have evidence it was shot down by a missile.\n\nSeparatist fighters in the region have shot down a number of Ukrainian planes and helicopters in recent days, and there is circumstantial evidence pointing to the seizure of a Buk missile system from the Ukrainian army by rebels.\n\nA video has surfaced from several days ago in which a well-known Kremlin cheerleader, Sergei Kurginyan, said after a visit to Donetsk in recent days that the rebels had seized a Buk system. Kurginyan said in the video that specialists from Russia had travelled to the region to fix the missile system, \"as a friendly gesture to a brotherly nation\".\n\nAdditionally, a news item on Russian state television from late June announced that the rebels had taken control of a Ukrainian Buk system. But Klimkin was adamant that this was not the case.\n\n\"Our military forces don't use any sort of anti-air missile in the region of anti-terror operation, so there could be no even theoretical possibility of taking this kind of missile,\" he told the Guardian. He suggested the missile system could have been smuggled into Ukraine from Russia:\n\n\"In recent weeks we have had continuous inflow of mercenaries, money, weapons and heavy weaponry across the border, including tanks and Manpads [man-portable air-defence systems],\" said Klimkin.\n\nHe claimed that given the border was several hundred miles long, and in places \"controlled by the terrorists\", it was possible that a missile system could have been brought across the border without detection.\n\nKlimkin insisted that recordings released by Ukraine's SBU security services on Thursday of separatist fighters admitting they had downed a passenger liner were \"absolutely genuine\".\n\nUkraine's foreign minister said he had spoken overnight to a number of his western counterparts, including the new UK foreign secretary, Philip Hammond, who offered British assistance and support.\n\nKlimkin said a video-conference had taken place on Thursday evening between the separatists and the Ukrainian president's representative, the former president Leonid Kuchma, which included mediation from the Organisation for Security and Co-operation in Europe (OSCE) and the Russian ambassador to Ukraine.\n\nAccess to the location had been negotiated for the OSCE and Ukrainian officials, said Klimkin, who declined to give details of what kind of delegation would travel to the crash site and when, citing security issues.\n\nThe Donetsk region contains a number of different militias whose actions are not always coordinated, and an aide to the rebel commander Igor Strelkov told Associated Press on Thursday that his boss had not yet decided whether to allow investigators access to the site.\n\nThe rebels claim the plane was down by the Ukrainian government.",
                "title": "Ukraine: missile that downed MH17 plane was not ours",
                "updated_at": {
                    "$date": "2014-08-05T19:43:05.393-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:07.695-0400"
                },
                "ext_url": "http://www.boston.com/news/world/europe/2014/07/18/russia-denies-role-downing-airliner/LW0MEiHpFU0CocjIaBjwmL/story.html",
                "image": "http://p.o0bc.com/rf/image_255x106/Boston/2011-2020/2014/08/04/Boston.com/BCOM/Images/StolenSUVs1.jpg",
                "text": "Russian officials were adamant that they had nothing to do with the disaster, continuing to point fingers at the Ukrainian government and military. “In view of various types of speculation concerning operations of the Russian armed forces in the areas bordering Ukraine, we affirm that the anti-aircraft means of the Russian armed forces did not operate in that region on July 17,” the Defense Ministry said in a statement posted on its website.\n\nThe crash site was still unsecured by midday Friday, raising questions about who controlled the flight data recorder, cockpit voice recorder and other onboard devices that could help determine exactly how the crash occurred. Rebel spokesmen said they had recovered most of the devices, but it was unclear when and to whom they would turn them over for investigation.\n\nGRABOVO, Ukraine — As rescue teams slowly converged on the grisly scene of the downing of a Malaysia Airlines jet, the Russian Defense Ministry on Friday denied any involvement in the missile strike that Ukrainian officials said ripped the Boeing 777 from the sky on Thursday, and many began questioning why the airline had chosen to fly a civilian jet over a combat zone.\n\nThe statement also said its air force was not flying within Russia in the areas bordering Donetsk on Thursday.\n\nOfficials in the United States confirmed late Thursday that Flight 17, with 298 people aboard, had been shot down over Grabovo, Ukraine, by what they described as a Russian-made antiaircraft missile. Fighting in eastern Ukraine between the Ukrainian military and pro-Russian separatists has been marked by the successful use of missiles against aircraft at higher and higher altitudes. The downing on Thursday of Flight 17, struck at 33,000 feet, was the first at cruising altitude for modern commercial jets, however.\n\nThe Russian defense statement noted that units of the Ukrainian Army possessed the BUK M1 air defense missile launchers that officials said were most likely responsible for bringing the jetliner down. Much of the speculation surrounding the crash has focused on that system, particularly since the pro-Russian separatist forces in eastern Ukraine bragged on social media in late June that they had taken possession of a BUK system after capturing a Ukrainian military base.\n\nThe crash remained the subject of intense debate in the small Ukrainian town of Grabovo, as residents tried to come to grips with what had unfolded in the fields where they work, just yards from their homes.\n\nTwo villagers said they had seen the flash of a rocket in the sky around the time the plane went down. Victor, who said he was too afraid to give his last name, said that he had been in his garden at the time and that he had seen “the light coming from a rocket.”\n\nHe said it had come from the direction of Snizhne, a city where the Ukrainian military has been bombing rebel positions frequently for more than a week. “It was a rocket, I’m sure of it,” he said.\n\nThe other villager, Sergei, 15, who also did not want to give his last name, said he had been swimming in a nearby river when he saw what appeared to be a rocket being launched into the sky. He said he then jumped out of the water, hopped on his motorbike and sped home.\n\nAs a cloudy dawn came, the full horror of the crash site was on display. Small white pieces of cloth dotted the grassy farmland, marking the spots of bodies.\n\nFour rebels in fatigues were wandering through the ruins, looking through people’s belongings and riffling through guidebooks and bags.\n\nWhen asked who was responsible for the crash, they looked incredulous and said that it had of course been the Ukrainian military.\n\n“This wasn’t ours,” said a rebel who identified himself only as Alexei, standing looking at an overhead bin in the grass with a rifle over his shoulder. “Why would we do this? We’re not animals.”\n\nThe plane appeared to have broken apart at a great height as pieces were scattered across several miles of agricultural fields. The plane was full of fuel when it crashed and the fire near the engine was fierce, turning the twisted metal remains into molten pools that had hardened by morning.\n\n“This is direct provocation of the EU and the U.S.,” said a rebel, Alexander Nikolaevich, who was walking along the road near the scene. “You see our weapons,” he said pointing to his aging gun. “We started to win the war and the fascists did this to stop us.”\n\nWhen asked if the fight would continue, he said, “a little bit.”\n\nIn Malaysia, the heavily Muslim nation in Southeast Asia, people mourned on a holy Ramadan Friday, shocked at the sudden loss of a second Malaysia Airlines Boeing 777-200. Many began questioning why the plane was flying over a conflict in eastern Ukraine where increasingly powerful surface-to-air missiles were being used.\n\nIn a statement delivered before dawn in Kuala Lumpur, Prime Minister Najib Razak of Malaysia noted that the International Civil Aviation Organization had declared the airspace safe and that the International Air Transport Association had not restricted travel there. “We must — and we will — find out precisely what happened to this flight,” he said.\n\nPeppered with questions about the aircraft’s route during a news conference late Thursday at a Kuala Lumpur airport hotel, Liow Tiong Lai, the Malaysian transport minister, said the aircraft had been following a safe route that Malaysia Airlines had used for many years and that was still used by most Asian airlines and by many European airlines, including on the day of the crash. “During that period of time, there are also many other aircraft using the same route,” he said.\n\nEuropean and Ukrainian air traffic controllers had continued to route civil flights over the contested area even as the fighting worsened — and even as flights directed by Russian air traffic controllers had apparently started to avoid it.\n\nUkrainian intelligence has pointed to a fighter named Igor Bezler, the militia leader in the eastern town of Gorlovka, as saying in an intercepted phone call that his men had “shot down a plane” on Thursday. Several assassinations are believed to have happened under Bezler’s watch soon after his forces took Gorlovka, and he took responsibility for killing a number of Ukrainian militiamen in the town of Volnovakha some weeks ago.\n\nAccording to Russian Internet sources, Bezler was born in 1965 in Crimea, and studied in Russia. He served in the Russian military but moved back to Ukraine in 2003, where he began to work as the head of security for a factory in Gorlovka. Biographies also note that he had worked in a company that performed burial services but was fired in 2012. He has been wanted by the Ukrainian authorities since April 2014.\n\nBezler’s nom de guerre is Bes, which in Russian sounds like the first syllable of his last name, but also means demon. There are rumors that Bezler does not get along with other militia leaders, and that he has had street battles with the Vostok Battalion, though rebels have dismissed those allegations.\n\nIn a slickly produced video called “Heroes of Novorossii,” the name of the self-declared insurgent region, Bezler was shown wearing a light blue beret. In a recent interview with the Russian news agency RIA Novosti, he claimed to be holding 14 Ukrainian soldiers hostage and said that the Ukrainian military had fallen apart, “much like the condition of the Russian military in the early 1990s.”\n\nIn the interview, Bezler said he was a Russian passport holder but had a residency permit in Ukraine. He said he sang the national anthem of the Soviet Union every morning, and usually went to bed around 10:30 p.m. He confirmed that he had worked as head of security for the Gorlovka factory, and claimed that he was fired from the burial services company over a fight with the local mayor who he said was demanding bribes.\n\nPeter Marosszeky, a longtime aircraft engineer and former senior executive at Qantas, PanAm and American Airlines who advised Boeing on the development of the 777 aircraft, said in a telephone interview that the 777-200 had an extremely long range and would have enough fuel to divert around a dangerous area during a 12-hour flight if the pilots chose to do so. But he said that airlines have typically not worried until now about surface-to-air missiles reaching planes at cruising altitude, because only a very large missile with a lot of fuel could ascend such a distance.\n\nMarosszeky expressed skepticism that militiamen could readily fire such a large missile without training as well as cooperation from whoever owned or manufactured the missile. “You’ve got to have special codes and so forth to operate these things,” he said.\n\nQuestions about why commercial air traffic was continuing in the area — and about when air traffic should be stopped over similar areas of fighting in the future — could prove difficult to answer. The investigation into the loss of Flight 17 is laden with potential disputes over sovereignty.\n\nMark A. Dombroff, a partner focusing on the aviation industry at McKenna Long & Aldridge, a national law firm in the United States, said that legal precedents indicated that if a plane is downed by military action, the lead country in the investigation is the one over whose territory the plane was shot down. That appears to be Ukraine in this case — but the rebels in eastern Ukraine, where the plane crashed, do not recognize the leadership in Kiev and may try to claim the lead role in the investigation.\n\n“One of the most complicated factors is getting investigators on the ground in hostile territory,” Dombroff said.\n\nUkraine or the rebels — or both — could decide to transfer leadership of the crash investigation either to the country of registry of the aircraft, which would be Malaysia, or to the country of manufacture of the Boeing 777, which would be the United States.\n\nAlexander Borodai, the prime minister of the self-declared Donetsk People’s Republic, the main separatist organization, said the group was setting up a committee to investigate the crash, the news agency Interfax reported. Russian government officials continued to emphasize the official line Friday that the investigation was under Ukrainian jurisdiction.\n\nLeading a crash investigation is in some ways a formality for developing countries, as most of the world’s investigators with crash experience tend to come from countries that manufacture aircraft and certify their airworthiness. Russia’s proximity to the crash site, close ties to the rebels and extensive aviation experience means that it could try to play a sizable advisory role, particularly if the rebels follow through on reported plans to locate the flight data recorders and send them to Moscow.\n\nThe crash is another setback for Malaysia Airlines, which has already been struggling to recover from the loss of Flight 370, which vanished on March 8 during a red-eye flight from Kuala Lumpur to Beijing.\n\nThe enduring mystery over Flight 370 has already severely hurt demand for Malaysia Airlines tickets, forcing the airline to offer budget carrier prices even though it bears the costs of a full-service airline.\n\nBoth Korean Air Lines and Asiana Airlines have confirmed that they have not flown planes through Ukrainian airspace since March 3.\n\n“We detoured our flight because of political instability there,” said Lee Hyo-min, a spokeswoman at Asiana, which had been flying a cargo plane through Ukrainian airspace once a week from Brussels to Incheon, South Korea, until that point.\n\nKorean Air Lines had been sending 42 passenger and cargo flights per month through Ukrainian airspace, but those flights had been rerouted, beginning on March 3, company officials said.\n\nCivilian jetliners have been shot down on a few previous occasions, including by the United States. The USS Vincennes used a pair of surface-to-air missiles in 1988 to destroy Iran Air Flight 655, killing 290 people, when the ship’s radar operators mistakenly concluded that the plane was descending toward them in a possible attack. A later review found that the jetliner was ascending at the time. It had been following a flight path that Iranian F-14 fighter jets had used in the preceding days to approach the American vessel, before veering away when warned by radio.\n\nIn 1983, a Russian Air Force fighter jet downed a Korean Air Lines flight that was traveling from New York City to Seoul by way of Anchorage, after the plane wandered off course.\n\nChinese fighters shot down a Cathay Pacific airliner in 1954 off the coast of Hainan Island, southern China, in an incident that had its roots in a civil war. China’s explanation at the time was that it had feared the Cathay Pacific plane was a military aircraft belonging to the nationalists on Taiwan, who had lost the civil war in mainland China but who were technically still at war.",
                "title": "Russia Denies Role in Downing of Airliner",
                "updated_at": {
                    "$date": "2014-08-05T19:43:07.695-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:08.605-0400"
                },
                "ext_url": "http://www.washingtonpost.com/news/checkpoint/wp/2014/07/18/the-intercepted-phone-call-that-ukraine-alleges-explains-the-demise-of-malaysia-airlines-flight-17/",
                "image": "http://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_908w/2010-2019/WashingtonPost/2014/07/18/Foreign/Images/2014-07-17T184929Z_01_MOS89_RTRIDSP_3_UKRAINE-CRISIS-AIRPLANE.jpg&w=480",
                "text": "As the world struggled on Thursday to grasp how Malaysia Airlines Flight 17 tumbled from the sky and exploded in eastern Ukraine, the Kiev government posted a video online that it said demonstrated that pro-Russian separatists backed by Moscow shot it down.\n\nThe video, including English-language subtitles, can be seen here:\n\nU.S. officials have not said whether they believe the recording to be authentic, and The Washington Post is unable to verify its authenticity. If the Ukrainian claims are legitimate, the recording would seem to bolster the narrative that separatists shot down the plane without realizing it was a civilian airliner.\n\nAs noted on The Post’s live blog yesterday, three Russian language speakers working for the newspaper independently verified the English translation used. One voice on the tape says either “we have just shot down a plane” or “they have just down the plane.” (This Russian statement could be translated in either way in the context of this conversation.)\n\nThis screenshot, circulated widely on social media Thursday, purportedly showing Igor Girkin, a man said to be aligned with the Russian military, bragging about his men shooting down to planes over Ukraine. IT was posted on VK.com, Russia’s version of Facebook:\n\nThe man is also known as Igor Strelkov. A journalist in Ukraine reporting for Buzzfeed highlighted earlier this month the heavy hand that he has used to keep order in Slovyansk, a city of about 119,000 in eastern Ukraine.\n\n“I warn all fighters and commanders of the DPR militia, and also residents of Slovyansk and the Sloviansk area, that any grievous crime committed in the zone of military activity will continue to be punished ruthlessly and decisively,” according to an order issued by Girkin and published by Buzzfeed. “The command of the DPR militia will not allow unchecked criminality. Punishments for crimes will be unavoidable, regardless of the status and service of the criminal.”\n\nExecutions over relatively petty crimes have been common under his watch, Buzzfeed reported.\n\nUPDATE: July 18, 11:35 a.m.: This post has been updated to reflect The Post’s translation of the video.",
                "title": "The intercepted phone call that Ukraine alleges explains the demise of Malaysia Airlines Flight 17",
                "updated_at": {
                    "$date": "2014-08-05T19:43:08.605-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:09.994-0400"
                },
                "ext_url": "http://www.theguardian.com/world/2014/jul/17/malaysia-airlines-plane-missile-attack-ukraine",
                "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/17/1405623247207/People-walk-among-the-deb-011.jpg",
                "text": "The president of Ukraine has accused pro-Russia rebels in the east of the country of shooting down a Malaysia Airlines jet with a ground-to-air missile, killing all 298 people on board as the airliner exploded and rained down in fiery pieces over a rural Ukrainian village.\n\nThe huge loss of life threatens to have wide-ranging and unpredictable consequences, coming just after the US imposed further sanctions on Russia for continuing to provide weapons to the rebels. Defence and security experts said the Russian-made Buk surface-to-air missile system, known to be in the hands of pro-Russia fighters in Ukraine, was most likely used.\n\n\"This was not an 'incident', this was not a 'catastrophe', this was a terrorist act,\" said Ukraine's president, Petro Poroshenko.\n\nThe US vice-president, Joe Biden, said the plane appeared to have been \"blown out of the sky\", while the Ukrainian security services released an audio recording said to be rebel commanders realising their forces were responsible.\n\nA partial breakdown of passenger nationalities was released early on Friday, showing that 154 Dutch nationals, 43 Malaysians and 27 Australians were on board, along with nine passengers believed to be from the UK, four each from Germany and Belgium, three from the Philippines, one Canadian and 41 unverified. A group of international HIV/Aids experts flying to Melbourne were among those killed. Included in those numbers were the flight crew of 15, all Malaysian.\n\nThe jet, which was flying from Amsterdam to Kuala Lumpur, came down near the village of Grabovo, part of the area controlled by pro-Russia separatists, on Thursday.\n\nIt had been flying 1,000ft above restricted airspace, according to the European air traffic control body. Eurocontrol said Ukrainian authorities had banned aircraft from flying at 32,000ft or below and the doomed aircraft had been cruising at 33,000ft – however this apparently still left it within range of the sophisticated surface-to-air weaponry that pro-Russia forces have been using recently in the Ukraine conflict. All civilian flights have now been barred from the area of eastern Ukraine.\n\nMalaysia's prime minister, Najib Razak, said: \"If it transpires that the flight was shot down, we insist that the perpetrators must swiftly be brought to justice.\" His country was sending a disaster response and assistance team to Ukraine.\n\nThe Australian prime minister, Tony Abbott, said the world should be \"filled with revulsion\" at the plane's destruction and said \"Russian proxies, using Russian-supplied equipment\" may have been responsible. Australia's foreign minister, Julie Bishop, said that if MH17 had been shot down it amounted to an \"unspeakable crime\" and a full international investigation must be allowed to take place. She said pro-Russia rebels, said to have retrieved the plane's black box flight recording equipment, must hand it over to authorities.\n\nIn brief remarks the US president referred to the \"terrible tragedy\" and said efforts were under way to determine whether Americans had been killed. \"The world is watching,\" he said. \"The United States will offer whatever assistance we can to determine what happened and why.\" John Kerry, the secretary of state, made a statement of condolence and called for a \"credible international investigation\".\n\nThe British foreign secretary, Philip Hammond, said: \"We do believe that there were British nationals on board the flight. We are working through passenger data, cross-checking it and referencing it to establish exactly the numbers and identities of those British nationals.\"\n\nThe field next to the tiny hamlet was a scene of charred earth and twisted metal as shocked local people milled around the scene. Body parts belonging to the 298 people on board were strewn around. The body of what appeared to be a young woman was flung about 500m from the centre of the crash.\n\nUS government officials confirmed to media outlets that a surface-to-air missile brought down the plane. US intelligence was reportedly still working to determine the exact location from which the missile was fired, and whether it was on the Russian or the Ukrainian side of the border.\n\nRebels in the self-declared Donetsk and Luhansk people's republics have shot down several Ukrainian planes and helicopters in recent weeks. But they insisted they had no part in the downing of MH17, claiming instead that Ukrainian fire was responsible.\n\nUkraine's SBU security services released a recording, which could not immediately be verified, of what it said were rebel commanders saying they had shot down a plane and then discovering with horror it had been a civilian jet.\n\nOn the ground in Grabovo, a strong smell of aviation fuel and burnt rubber hung in the air as dozens of pro-Russian separatist fighters milled around to control access to the area in which workers from the emergency services were sifting through the wreckage. A dozen fire engines were on the scene.\n\nOne local resident, Alexander, was working in a field a few hundred metres from the crash site. He said he feared the aircraft was going to fall on top of him. Another farmer said he was on his tractor when he heard a loud bang. \"Then I saw the plane hit the ground and break in two – there was thick black smoke,\" he said.\n\nIn a conflict that has not been short of unexpected twists, this was by far the most shocking and most gruesome to date. The 298 people aboard MH17 had no connection to the fighting except that their intercontinental flight was travelling through airspace above the battle zone.\n\nQuestions were being raised as to why Malaysia Airlines had continued to fly over such a volatile region, where separatists were known to be shooting at aircraft. Qantas, the Australian carrier, said it had been steering clear of the area by 400 nautical miles for several months. Malaysia Airlines said after the crash that it had altered its flight paths and other airlines either did likewise or emphasised they had already been taking alternative routes.\n\n\"With immediate effect, all European flights operated by Malaysia Airlines will be taking alternative routes avoiding the usual route,\" said a statement from the airline. It added: \"The usual flight route was earlier declared safe by the International Civil Aviation Organisation. International Air Transportation Association has stated that the airspace the aircraft was traversing was not subject to restrictions.\"\n\nThroughout the conflict, the versions of violent incidents provided by Kiev and the Donetsk rebels have diverged wildly, with each side blaming the other for loss of life and the shelling of residential areas.\n\nNow, with such a huge and unexpected loss of life, the stakes are immeasurably higher, and both sides again rushed to claim the other was at fault.\n\nThose blaming pro-Russia rebels for the attack pointed to a post on a social media site attributed to a top rebel commander which claimed to have downed a Ukrainian transport plane around the same time as the first reports of MH17's disappearance surfaced. The post was later deleted.\n\nThe US and EU have blamed Russia for providing the separatists in eastern Ukraine with logistical and military support, leading to a new set of White House sanctions against Russian companies, introduced on Wednesday, as rhetoric coming out of both Washington and Moscow has led to talk of a new cold war. Vladimir Putin's spokesman Dmitry Peskov told the Guardian that any allegations of Russian involvement in the tragedy were \"stupidity\".\n\nHe said the Kremlin would not make a further statement because \"no one knows\" who is responsible. Asked about the possibility of further US sanctions, Peskov said he could not rule it out: \"The United States has recently been conducting a very nonconstructive policy, and their actions are very unpredictable,\" he said.\n\nPutin himself, who on Thursday returned to Russia from a summit of the Brics nations in Brazil, informed Barack Obama about the incident.\n\n\"The Russian leader informed the US president of the report from air traffic controllers that the Malaysian plane had crashed on Ukrainian territory, which had arrived immediately before the phone call,\" said a statement released by the Kremlin.\n\nAccording to the statement, the pair spent most of the conversation discussing the deterioration of US-Russian relations, and Putin expressed his \"serious disappointment\" over the latest round of US sanctions against Russian companies.\n\nLater, Putin chaired a meeting on the Russian economy which began with a minute's silence, and laid the blame for the crash at Ukraine's door: \"There is no doubt that the nation over whose airspace this happened bears responsibility for the terrible tragedy,\" he said.\n\nObama said the downing of the plane looked like \"a terrible tragedy\".\n\nDavid Cameron, the British prime minister, tweeted: \"I'm shocked and saddened by the Malaysian air disaster. Officials from across Whitehall are meeting to establish the facts.\"\n\nPutin later spoke by phone to the Malaysian prime minister, Najib Razak, to express his \"most sincere condolences\" to the families of the dead.\n\nThe crash came four months after a Malaysia Airlines flight, MH370, vanished on a flight from Kuala Lumpur to Beijing with 239 people on board, two-thirds of them Chinese citizens. It has yet to be found despite a huge search.\n\nThe first rumours of improbable tragedy came as video appeared from villages nearby showing huge plumes of smoke rising into the air, and aviation sources told a local wire agency that a plane had been downed.\n\nThe first official confirmation came when Anton Gerashchenko, an adviser to Ukraine's interior minister, wrote on his Facebook page that the plane had indeed crashed in Ukrainian territory, claiming it had been hit by a missile fired from a Buk launcher.\n\nMalaysia Airlines soon confirmed the worst fears, noting via its Twitter feed: \"Malaysia Airlines has lost contact of MH17 from Amsterdam. The last known position was over Ukrainian airspace.\"\n\nIgor Sutyagin, a Russian military specialist at the London-based Royal United Services Institute, agreed that the plane would almost certainly have been hit from a Buk, a vehicle-mounted missile system first developed in the Soviet era. The Malaysian aircraft,was beyond the range of Manpads – shoulder-launched missiles. Kalashnikov-carrying Russian sympathisers in Ukraine would not have had the expertise to fire them and would have needed either specialists who had \"volunteered\" their services from Russia or locally recruited specialists, he said, but noted that the rebels had been firing at Ukrainian aircraft over the last week.\n\nThe Associated Press said one of its journalists had seen a similar launcher near the town of Snizhne earlier on Thursday.\n\nRussia's state-owned Channel One avoided speculation of who might have been behind the plane crash in its first bulletins on the subject, while the Kremlin-friendly Life News, whose reporters were first on the scene, said it was likely to have been brought down by Ukrainian fire, claiming that the rebels did not have any missile systems with the capacity to down a plane travelling at that altitude.\n\nHowever, a report on the website of Russian state television from late June described how the rebels in Donetsk had taken control of a Ukrainian missile defence facility which was equipped with Buk systems. The report said that the rebels planned to \"defend the sky over Donetsk\" using the missile system.\n\nOn Thursday afternoon a social media site attributed to Igor Strelkov, a Russian citizen who has emerged as the commander of rebel forces in Donetsk, announced that the rebels had shot down an An-26 Ukrainian transport plane, and also that there was \"information about a second plane\". The post was later removed.\n\nOn Thursday night audio was being circulated on social media, apparently released by Ukrainian security services, purporting to be an intercepted conversation of pro-Russian rebels confirming they had shot down a civilian jet.\n\nThe conversation is apparently between a group leader and his superior and suggests that they initially thought they had brought down a military aircraft but later realised their error.\n\nThe group leader, \"Demon\", tells his boss: \"A plane has just been shot down. [It was] 'Miner's' group. It crashed outside Enakievo. Our men went to search for and photograph it. It's smouldering.\"\n\nAfter his men apparently inspect the crash site, Demon reports back. \"Cossacks from the Chernunkhino checkpoint shot down the plane. The plane disintegrated in mid-air … they found the first body. It's a civilian.\"\n\nHe carries on: \"I mean. It's definitely a civilian aircraft.\"\n\nHis superior, nicknamed \"Greek\", asks him: \"Were there many people?\"\n\nDemon replies: \"A fuckton. The debris rained right into the yards.\"\n\nGreek asks: \"What's the aircraft?\" and is told: \"I haven't figured it out yet. I haven't reached the main section. I only looked at where the bodies began to fall. There are remains of chair mounts, the chairs, the bodies.\"\n\nGreek asks: \"Any weapons there?\" and Demon says: \"None at all. Civilian things, medical stuff, towels, toilet paper.\" \"Any documents?\" asks Greek, and Demon, perhaps realising what has just happened, replies: \"Yes, an Indonesian student from [a US] university.\"\n\nAdditional reporting by Tania Branigan in Beijing, Ewen MacAskill in London and Paul Lewis in Washington\n\n• This article was amended on 18 July 2014. An earlier version had the word \"Kazakhs\" where it should have said \"Cossacks\".",
                "title": "Missile destroys Malaysia Airlines plane over Ukraine, killing 298 people",
                "updated_at": {
                    "$date": "2014-08-05T19:43:09.994-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:13.376-0400"
                },
                "ext_url": "http://www.latimes.com/nation/nationnow/la-fg-satellites-ukraine-missile-20140717-story.html",
                "image": "http://www.trbimg.com/img-53c89d55/turbine/la-fg-satellites-ukraine-missile-20140717",
                "text": "Advanced U.S. satellites played a key role in the determination by intelligence officials that a surface-to-air missile shot down a Malaysian jetliner over Ukraine on Thursday.\n\nThe assessment was almost certainly based on a technical branch of spycraft known as measurement and signature intelligence, or MASINT, analysts said. The method detects, tracks and identifies a variety of electronic signatures, including radar.\n\nThe U.S. operates fleets of listening satellites and early warning satellites that could have identified the location of a missile launch site and its trajectory as it shot up to the 33,000-foot cruising altitude of the Malaysia Airlines Boeing 777.\n\nThe Pentagon would have detected the launch because of its heat signature, said Riki Ellison, founder and chairman of Missile Defense Advocacy Alliance, a group that lobbies for missile defense spending.\n\nThe U.S. Air Force has satellites in high-Earth orbit that use infrared sensors to detect heat from missile and booster plumes against Earth's background. Called the Defense Support Program, the system provides early warning for intercontinental ballistic missile launches.\n\nThe satellites are sensitive enough to sense hot spots in forest fires, according to the Air Force.\n\nU.S. radar installations and other assets in the region would assist in tracking any surface-to-air missile, which Ukrainian officials have said probably came from a Russian-made Buk system. The information would be relayed to U.S. European Command, headquartered in Stuttgart, Germany.\n\n\"They would have known exactly where it was launched, where it was headed, and the rate at which it was traveling,\" Ellison said.\n\nSeparately, the U.S. operates sensitive listening satellites that can capture a wide range of electronic emissions from foreign nations' defense systems, allowing analysts to determine the origin of the signals and the type weapon that was used.\n\nFor instance, the Buk missile uses a strong radar search and tracking system to find its targets and then helps guide a missile to the target. At some point in its flight, the missile begins to use its own radar system, emitting a unique signal.\n\nThe combination of unique signals over a period of seconds or minutes would allow a U.S. satellite to triangulate the point of launch and track the trajectory of the missile.\n\nFor more news on the Malaysia Airlines crash, follow @rvartabedian and @wjhenn on Twitter.",
                "title": "High-tech spycraft tracked missile's path to Malaysia Airlines jet",
                "updated_at": {
                    "$date": "2014-08-05T19:43:13.376-0400"
                }
            }
        ],
        "title": "Malaysia Airlines Flight 17 shot down over eastern Ukraine, killing 298"
    },
    {
        "_id": {
            "$oid": "53e1674c2c243f694e1c5fdc"
        },
        "articles": [],
        "title": "20th edition of FIB music festival begins"
    },
    {
        "_id": {
            "$oid": "53e1674f2c243f694e1c5fdd"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:19.905-0400"
                },
                "ext_url": "http://in.reuters.com/article/2014/07/17/india-rbi-banks-idINKBN0FM1ED20140717",
                "image": "http://s2.reutersmedia.net/resources/media/global/assets/images/20140804/20140805_4112059020140804183528.jpg",
                "text": "Commemorating the 100th anniversary of the outbreak of World War One.\n\nThe minimum paid up capital required for both categories of bank licenses would be 1 billion rupees ($16.62 million) of which the promoter would have to contribute at least 40 percent initially, the RBI said.\n\nPayments banks can accept deposits and remittances of funds but cannot provide loans. Small banks can lend, but have more limited areas of operations than a full-fledged commercial lender.\n\nThe guidelines are part of the RBI's push to set up smaller banks that can more easily penetrate into India's hinterland and increase lending to farmers, small traders and businesses.\n\n\"Both, payments banks and small banks are 'niche' or 'differentiated' banks, with the common objective of furthering financial inclusion,\" the RBI said in the draft rules.\n\nThe RBI in April granted its first two bank licences in a decade in a country where half the households are still outside the banking system.\n\nThe central bank had said then it would move to grant bank licences more regularly and would work on a policy for having \"differentiated\" bank permits.\n\nUnder the guidelines provided on Thursday, mobile phone carriers, super-market chains, co-operatives, and non-banking financial companies will be eligible to apply for permits for setting up payments banks.\n\nMeanwhile, resident individuals with ten years of experience in banking and finance, companies and societies, non-banking finance companies and micro-finance institutions will be eligible for setting up small banks.",
                "title": "RBI issues draft rules for small banks in financial inclusion push",
                "updated_at": {
                    "$date": "2014-08-05T19:43:19.905-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:22.510-0400"
                },
                "ext_url": "http://www.business-standard.com/article/finance/rbi-sets-stiff-terms-for-niche-bank-licences-114071701101_1.html",
                "image": "http://bsmedia.business-standard.com/_media/bs/img/article/2014-07/18/full/1405624559-6691.jpg",
                "text": "The Reserve Bank of India (RBI) on Thursday paved the way for niche banking by issuing draft guidelines for setting up payment and small banks. While payment banks will offer remittance services, small banks will offer low-ticket loans and basic banking services within a limited area of operation.\n\n \n\n After initial screening to ensure eligibility, the central bank will set up an external committee to vet applications, which will be invited after the final norms are issued. Successful applicants will have to start operations within a year of the date of approval.\n\n \n\n Both these categories of banks could set up subsidiaries to undertake non-banking financial company (NBFC) activities, said. This was seen as a hindrance for existing NBFCs to convert themselves into banks.\n\n \n\n The minimum paid-up capital required for both categories would be Rs 100 crore, of which the promoter would have to contribute at least 40 per cent initially, with a five-year lock-in period, RBI said. They would also have to maintain a capital adequacy ratio of 15 per cent, though under Basel-I norms.\n\n \n\n If promoter shareholding exceeds 40 per cent, it has to be cut to this level within three years of operations, 30 per cent within 10 years and 26 per cent within 13 years.\n\n \n\n Promoter groups, RBI said, would be subject to stringent ‘fit & proper’ criteria such as sound credentials and integrity and successful track records of running business for at least five years. The central bank also said it would adopt a cautious approach in granting new licences, as only a few aspirants would be allowed. The cases would be reviewed after these entities gained experience.\n\n \n\n For better corporate governance practices, the draft guidelines mandate independent directors should account for the majority of the boards of these banks.\n\n \n\n\n\nNorms on voting rights have been kept on a par with those applicable to existing private banks---capped at 10 per cent, which can be raised to 26 per cent in a phased manner, with prior RBI approval. Acquisition of more than five per cent stake in the entity will also require prior RBI approval.Muthoot Finance, which had applied for a banking licence last year, said the NBFC would be keen to apply for a differentiated bank licence, adding it might apply for both types of licences, if regulations allowed this. “A small bank makes more sense, as it covers a wide range of activities and also because of our strong lending portfolio. A final decision will be taken after the final guidelines come,” said Oommen K Mammen, chief financial officer of the company.The norms for payment banks are on the lines of the recommendations of the Nachiket Mor committee on financial services for small business and low-income households—prepaid instrument issuers can carry out payment services, but cannot lend. Payment banks, which will have to maintain a particular cash reserve ratio, will deploy funds only in government securities and have access to the uncollateralised call money market. Also, payment banks can accept only demand deposits and savings bank deposits; they cannot offer fixed deposit products.The highest balance a bank can hold per customer is Rs 1 lakh, against the Mor panel’s recommendation of Rs 50,000. Apart from existing non-bank PPI issuers, NBFCs, corporate business correspondents, mobile telephone companies, supermarket chains, real estate cooperatives and public sector entities will be considered eligible to set up payment banks.In its report, the Mor committee had mentioned the possibility of the postal department becoming a payment bank. India Post had applied for a universal licence last year, but this wasn’t entertained by RBI.“Preference will be given to applicants who propose to set up payment banks with access points primarily in under-banked states, districts in Northeast, East and the central region of the country,” RBI said.It added for credit and other services it couldn’t offer, a payment bank could become a business correspondent of another bank. However, it cannot set up subsidiaries to undertake NBFC activities. To differentiate them from other banks, such entities have to use the word ‘payment’ in their names.While payment banks won’t have to have a quarter of their branches in un-banked rural areas (as applicable for existing banks), they should have at least 25 per cent of their access points in such areas.In addition to NBFCs, microfinance institutions and existing local area banks, individual professionals with 10 years of experience in banking and finance will be allowed open small banks. The operations of such entities will be restricted to contiguous districts in a homogenous cluster of states, though these could be allowed to expand to more states, if necessary. Small banks’ branch expansion plans for the initial three years will require RBI approval, though this norm could be relaxed, based on performance.For the first three years, small banks will need RBI approval for branch expansion. The draft regulations said small banks would primarily undertake basic banking activities of accepting deposits and lending to small farmers, small businesses, micro and small industries and unorganised sector entities. “It can also undertake other simple financial services activities with prior approval of RBI,” the guidelines said.Small banks will also have to comply with the priority sector lending target of 40 per cent and set up a quarter of their branches in rural un-banked areas; both the norms are applicable to other domestic banks. Also, they have to meet cash reserve ratio and statutory liquidity ratio norms. Besides, all NBFCs, including microfinance institutions, must have net worth of at least Rs 100 crore.Applicants who had earlier applied for new bank licences but were denied may apply for differentiated banking licences.",
                "title": "RBI sets stiff terms for niche bank licences",
                "updated_at": {
                    "$date": "2014-08-05T19:43:22.510-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:24.048-0400"
                },
                "ext_url": "http://www.telegraphindia.com/1140718/jsp/business/story_18627404.jsp",
                "image": "../../images/18zzpush.jpg",
                "text": "Mumbai, July 17: Companies that nursed ambitions of entering the banking arena but were left out in the cold in April have a chance to make a grab for a new set of licences for which the Reserve Bank of India put out draft guidelines on Thursday. The banking regulator opened the doors a little wider by unveiling the rules of the game for two new categories of payment banks and small banks in the private sector with a minimum capital requirement of Rs 100 crore. In April, the RBI had cherry-picked just two entities — IDFC and Calcutta-based Bandhan Financial Services — from a field of 25 for the award of full-service banking licences for the first time in a decade. The capital requirement for a full-service bank is Rs 500 crore. The new guidelines for the so-called differentiated banks will open up the field with Bharti Airtel, the Future group and even Reliance Retail able to enter a crowded arena to wrest licences for a new set of niche banks. Non-banking finance companies (NBFCs), co-operatives, pre-paid instrument issuers and micro-finance institutions (MFIs) will also be able to throw their hats into the ring. The new banks will have a very limited scope of activity. For instance, payment banks will only accept demand deposits (current deposits and saving deposits) and provide payment and remittance services through various channels that include branches, business correspondents and mobile banking. They will not be allowed to lend money. The draft guidelines say that the payments/remittance services would include the acceptance of funds at one end through various channels, including branches and business correspondents, and payments of cash at the other end, through branches, business correspondents, and ATMs. More importantly, NBFCs, corporate business correspondents, mobile telephone companies, super-market chains, companies, co-operatives and public sector entities can apply for permission to set up a payments bank. The central bank explained that the objective of these banks would be to further financial inclusion by providing small savings accounts and payments or remittance services to migrant labour workforce, low income households, small businesses, other unorganised sector entities and other users. Since their primary role is to provide payments and remittance services and demand deposit products to small businesses and low-income households, the RBI said that a customer of a payments bank could hold a maximum balance of Rs 1 lakh. “After the performance of the payments bank is gauged by the RBI, the maximum balance can be raised,” it added. While these banks will also be subject to reserve requirements, the RBI proposed that they should also have a minimum cash-in-hand and balances with a scheduled commercial bank or the RBI for operational activities and liquidity management. Further, these banks will have to invest all its monies in government securities/treasury bills with maturity up to one year. The RBI also announced draft guidelines for setting up small banks that will provide a whole suite of basic banking products such as deposits and supply of credit, but it will operate in a limited area. Resident individuals/professionals with 10 years of experience in banking and finance, companies and societies will be eligible to become promoters of small banks. Moreover, existing NBFCs, MFIs, and local area banks can also opt for conversion into small banks. The area of operations of such a bank, it said, will normally be restricted to “contiguous districts in a homogenous cluster of states /Union territories so that the bank has the local feel and culture’’. However, the RBI will look favourably at proposals involving expansion of the bank’s area of operations beyond contiguous districts in one or more states with reasonable geographical proximity, it indicated. In the initial five years, the small bank will have to undertake basic banking activities: acceptance of deposits and lending to small farmers, small businesses, micro and small industries and unorganised sector entities. Significantly, the RBI added that after the initial stabilisation period of five years, and after a review, it might liberalise the scope of activities of the small banks. In both the cases, the promoters’ minimum initial contribution to the equity capital of the banks has been set at 40 per cent, which will be locked in for a period of five years from the date of commencement of business of the bank. Shareholding by promoters in the bank in excess of 40 per cent will have to be brought down to 40 per cent within three years from the date of commencement of business of the bank.",
                "title": "RBI opens doors to niche banks",
                "updated_at": {
                    "$date": "2014-08-05T19:43:24.048-0400"
                }
            }
        ],
        "title": "Reserve Bank of India publishes draft rules for niche banks"
    },
    {
        "_id": {
            "$oid": "53e167552c243f694e1c5fde"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:26.229-0400"
                },
                "ext_url": "http://news.yahoo.com/israel-pushes-gaza-expanding-ground-operation-193726233.html",
                "image": "http://l2.yimg.com/uu/api/res/1.2/tSztreHMepA7Aj.6UEXJBQ--/dz02NDA7Zmk9ZmlsbDtweW9mZj0wO2g9MzYwO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/video/video.associatedpressfree.com/e58d0f3c281cc89e6a7ca35c66461a8f",
                "text": "Comic books from the collection of Batman co-creator Bob Kane go up for sale in New York.Tara Cleary reports.\n\nYahoo Global News Anchor Katie Couric talks with Deena Varshavskaya about how Wanelo is like a digital mall with 300,000 stores on your phone.\n\nIsrael's military said Thursday it was calling up another 16,000 reserves, a move that could enable it to substantially widen its 23-day campaign against Islamic militants in the Gaza Strip.\n\nIsrael escalated its military campaign against Hamas on Tuesday, striking symbols of the group's control in Gaza and firing tank shells that shut down the strip's only power plant in the heaviest bombardment in the fighting so far. Flares turned the sky over Gaza City orange overnight and by daybreak, as the conflict entered its fourth week, heavy clouds of dust hovered over the territory. A thick column of black smoke rose from a burning fuel tank at the power plant.\n\nIsrael dramatically escalated its aerial assault targeting hundreds of Hamas sites in the Gaza Strip Thursday as Palestinians reported the strikes also hit a home and a beachside cafe, raising the total number of people killed in this week's offensive to at least 85. Israel's missile defense system also once again intercepted rockets fired by militants at the country's heartland. Military spokesman Lt. Col.\n\nIsrael escalates its campaign against Hamas, striking symbols of the militant group's control in Gaza and firing tank shells that Palestinian officials say shut down the strip's only power plant in the heaviest bombardment in the war so far. (July 29)\n\nIsrael Defense Forces have released aerial footage of strikes on alleged militant targets in the Hamas-ruled Gaza Strip. On the ground in Gaza, many homes have been destroyed.\n\nIsrael announced one of its soldiers has died in the offensive in Gaza. The circumstances are unclear. Israel intensified its 11-day campaign against Gaza's Hamas rulers by launching a ground operation late Thursday. (July 18)\n\nIsraeli Prime Minister Benjamin Netanyahu says he has ordered the military to prepare for a 'significant expansion' of its ground operation against militants in Gaza. (July 18)\n\nIsraeli troops pushed deeper into Gaza on Friday in a ground offensive to stop rocket attacks from Hamas. The Israeli prime minister ordered the military to prepare for a significant expansion of ground operations. (July 18)\n\nIsraeli troops pushed deeper into Gaza on Friday in a ground offensive that officials said could last up to two weeks as the prime minister ordered the military to prepare for a \"significantly\" wider campaign.\n\nThe assault raised risks of a bloodier conflict amid escalating Palestinian civilian casualties and the first Israeli military death — and brought questions of how far Israel will go to cripple Gaza's Hamas rulers.\n\nOfficially, the goal remains to destroy a network of tunnels militants use to infiltrate Israel and attack civilians. In its first day on the ground in Gaza, the military said it took up positions beyond the border, encountered little resistance from Hamas fighters and made steady progress in destroying the tunnels. Military officials said the quick work means that within a day or two, Israeli leaders may already have to decide whether to expand the operation.\n\nWith calls from Israeli hard-liners to completely crush Hamas, it remains unclear how far Israel will go in an operation that has already seen 299 Palestinians killed in 11 days of intense Israeli bombardment of the densely populated coastal strip, a fifth of them children.\n\nIsraeli Prime Minister Benjamin Netanyahu said he had ordered the military to prepare for a \"significant expansion\" of the ground offensive.\n\n\"It is not possible to deal with tunnels only from the air. It needs to be done also from the ground,\" he told a special Cabinet meeting in Tel Aviv. \"We chose to begin this operation after the other options were exhausted and with the understanding that without the operation, the price we will pay can be very high.\"\n\nFrustrated by Hamas' refusal to accept an Egyptian-brokered truce agreement and the failure of a 10-day campaign of more than 2,000 airstrikes to halt relentless rocket fire on Israeli cities, Israel launched a ground offensive it had previously been reticent to undertake to further weaken Hamas militarily.\n\n\"It won't end that quickly,\" said Yitzhak Aharonovitch, Israel's minister of public security. \"Anything can happen. If we need to keep going, we will keep going. We won't stop. We need quiet for the citizens of the south and the citizens of Israel.\"\n\nIn a fresh effort to broker a truce, U.N. chief Ban Ki-moon was to leave Saturday for the Middle East to help mediate the Gaza conflict, U.N. officials said. A cease-fire is \"indispensable\" for urgently needed humanitarian efforts to succeed, the under-secretary-general for political affairs Jeffrey Feltman told an emergency meeting of the Security Council.\n\nThe Israeli military said it had killed nearly 20 militants in exchanges of fire since the ground offensive started on Thursday night.\n\nGaza health officials said more than 50 Palestinians have been killed since then, including three young siblings from the Abu Musallam family who were killed when a tank shell hit their home.\n\nAt the morgue, 11-year-old Ahmed's face was blackened by soot, and he and his 14-year-old sister, Walaa, and 16-year-old brother, Mohammed, were wrapped in white burial shrouds. Their father, Ismail, said the three were sleeping when the shell struck and he had to dig them out from under the rubble.\n\nIsrael says it is going to great lengths to avoid civilian casualties and blames them on Hamas, accusing it of firing from within residential neighborhoods and using its civilians as \"human shields.\" On Thursday, the U.N. refugee agency for Palestinians, UNRWA, said a routine check in one of its vacant Gaza schools found about 20 hidden rockets and called on militants to respect the \"sanctity and integrity\" of U.N. property.\n\nCritics say it is the intense fire itself in such a densely populated area that leads to the deaths of innocent civilians. The U.N. children's agency, UNICEF, said at least 59 — or one in five — of the Palestinians killed children were under the age of 18. UNRWA said 40,000 Palestinians were seeking refuge in 34 of its shelters throughout the Gaza Strip.\n\nMost countries have expressed support for Israel's right to defend itself, while urging it to minimize civilian deaths in its ground assault. President Barack Obama spoke with Netanyahu Friday and expressed his concern \"about the risks of further escalation and the loss of more innocent life.\"\n\nThe operation also brought Israel its first military casualty. The circumstances behind the death of Staff Sgt. Eitan Barak, 20, were not made clear: Hamas's military wing said it ambushed Israeli units in the northern town of Beit Lahiya. A military spokesman said Barak was likely killed by friendly fire from a tank but it was not confirmed yet. The army said a number of soldiers were also wounded. Earlier in the week, an Israeli civilian died from Palestinian mortar fire and several others have been wounded.\n\n\"The ground offensive does not scare us and we pledge to drown the occupation army in Gaza mud,\" Hamas spokesman Sami Abu Zuhri said in a statement.\n\nIsraeli public opinion strongly supports the offensive after days of unrelenting rocket fire from Gaza and years of southern Israeli residents living under the threat. Gaza militants have fired more than 1,500 rockets at Israel over the past 11 days, and rocket fire continued across Israel Friday.\n\nThe order to launch the ground operation was triggered not by the rocket fire, but by a Hamas attempt to infiltrate Israel on Thursday, when 13 armed militants sneaked through a tunnel from Gaza and were killed by an airstrike as they emerged inside Israel.\n\nThe military, which has already mobilized more than 50,000 reservists, said paratroopers had uncovered eight tunnel access points across the Gaza Strip and engaged in several gun battles with Hamas militants who ambushed them.\n\nIsraeli forces are expected to spend a day or two staking ground within two miles (three kilometers) of the border in the north, east and south of the Gaza Strip. Then, they are expected to begin destroying tunnels, an operation that could take up to two weeks. Tanks, infantry and engineering forces were operating inside Gaza, where the military said it targeted rocket launchers, tunnels and more than 100 other targets.\n\nHamas has survived Israeli offensives in the past, including a major three-week ground operation in January 2009 and another weeklong air offensive in 2012, but in each case the militant group recovered. It now controls an arsenal of thousands of rockets, some long range and powerful, and it has built a system of underground bunkers.\n\nBut Hamas is weaker than it was during the previous two offensives, with little international or even regional support from its main allies, Turkey and Qatar. Protests against the offensive took place Friday in Turkey, Jordan and the West Bank.\n\nEgypt, which has been pushing for a cease-fire, is at odds with Hamas' conditions, which include a lifting of the siege of Gaza and completely open borders into the Sinai — where Egypt is already fighting Islamic extremists.\n\nHeller reported from Jerusalem. Associated Press writers Ian Deitch and Tia Goldenberg and Yousur Alhlou in Jerusalem, Karin Laub in Gaza City and Edith M. Lederer at the United Nations contributed to this report.",
                "title": "Israel pushes in Gaza, expanding ground operation",
                "updated_at": {
                    "$date": "2014-08-05T19:43:26.229-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:28.754-0400"
                },
                "ext_url": "http://www.latimes.com/world/middleeast/la-fg-israel-palestinians-gaza-strip-20140718-story.html#page=1",
                "image": "http://www.trbimg.com/img-53c9b2cd/turbine/la-fg-israel-palestinians-gaza-strip-20140718",
                "text": "Shells slammed into densely populated neighborhoods. Families wept over bloodied corpses and medical workers rushed to keep up with the wounded Friday as Israeli forces hunted rocket launchers and tunnels that Palestinian militants use to strike Israel.\n\nTroops backed by tanks and artillery pressed deeper into the coastal enclave in a ground offensive launched Thursday after 10 days of aerial bombardments failed to halt the rocket fire raining down on Israel's cities and towns from Gaza, which has been controlled by Hamas since 2007.\n\nIsrael has launched previous campaigns, including a major ground operation early in 2009. Each time, Hamas has quickly rebuilt its arsenal of rockets, which have grown more powerful and can now penetrate deep into Israeli territory.\n\nHard-liners in Israel have been calling for an all-out assault to drive Hamas from power. This incursion appeared more limited in scope, targeting a network of tunnels along the enclave's northern, eastern and southern frontiers that militants use to smuggle weapons and fighters into Israel.\n\nBut Prime Minister Benjamin Netanyahu told reporters he had instructed the military to prepare for the possibility of a “considerable expansion of the ground operation.”\n\n“We chose to embark on this operation after exhausting the other options and with the understanding that without the operation, we could pay a much higher price,” Netanyahu said as he headed into a meeting of his Security Cabinet.\n\nMore than 1,600 rockets have been fired at Israel since July 8, according to Israeli authorities. The country's Iron Dome antimissile system, built with U.S. assistance, has helped keep Israeli casualties to a minimum. One Israeli was killed by shelling from Gaza, and an Israeli soldier was killed during the ground operation. The cause of the military death was under investigation, but Israeli news reports said that friendly fire was suspected.\n\nNearly 300 Palestinians have been killed, most of them civilians, by Israeli airstrikes and ground attacks, according to Gaza medical officials quoted by the Maan news agency. More than 60 of them died since the ground operation began.\n\nHeavy fighting was reported in the northern Gaza cities of Beit Hanoun and Beit Lahiya, as well as around Khan Yunis and Rafah to the south.\n\nAmong the Palestinians killed Friday were three siblings ages 13 to 15 who died when their house in Beit Lahiya was shelled. A separate attack killed at least eight members of an extended family in Khan Yunis, according to Palestinian accounts.\n\nLoud explosions resonated throughout the day, sending families living in Gaza's frontier areas fleeing toward the interior on foot and in donkey carts.\n\nOthers, however, were afraid to leave their homes.\n\n“Where to go?” lamented Sharhabeel Mahmoum, a 37-year-old pharmacist and father of four reached by telephone in Beit Lahiya. “As long as Israeli planes are in the air, there is no safe place.”\n\nAmbulances cruised the streets searching for victims. A distraught man arrived at the Shifa hospital in Gaza City with two young children, their faces peppered with shrapnel wounds. In the hospital morgue, relatives grieved over the body of a woman covered with a soiled sheet.\n\nConstant bombardment has made life miserable in the impoverished enclave, knocking out already patchy power and water service and keeping families pinned down in their homes.\n\nBodour Kwaik, a 24-year-old aid worker, lost two family members in an Israeli airstrike early in the campaign. “I couldn't even say good-bye,” she said from her Gaza City apartment. “I couldn't go to the funeral because it was too risky.”\n\nIsraeli military officials said the complex network of tunnels through the Gaza Strip remains a potent threat, linking weapons caches and rocket launch-sites with homes and mosques used by militants to strike at Israel.\n\n“There appears to be some misunderstanding of how severe the tunnel threat really is,” said retired Maj. Gen. Gadi Shamni, a former commander of the Israel Defense Forces' Gaza Division. “A successful attack through such a tunnel … can turn everything around.”\n\nBefore the ground offensive began Thursday, Israeli officials said they intercepted 13 heavily armed fighters at the mouth of a tunnel in Israel. An airstrike is believed to have killed three of them, but the rest escaped, said Lt. Col. Peter Lerner, an Israeli military spokesman.\n\nA similar tunnel was used to capture an Israeli soldier, Gilad Shalit, in 2006. He was held for five years, until Hamas agreed to release him in exchange for more than 1,000 Palestinian prisoners .\n\nIsraeli troops have uncovered 10 tunnels with 22 exit points across the Gaza Strip since launching the ground operation, trading fire with Palestinian militants who attacked with guns and rocket-propelled grenades, military officials said. At least 17 militants were killed and 21 captured since the start of the ground operation, the military said.\n\nHamas called the decision to launch the ground operation dangerous, and threatened in a statement to “drown the occupation army in Gaza mud.”\n\nThe sharp escalation in the fighting came despite growing international pressure on the two sides to suspend hostilities.\n\nPresident Obama said he reaffirmed his support for Israel's right to defend itself in a telephone conversation with Netanyahu Friday.\n\n“No nation should accept rockets being fired into its borders, or terrorists tunneling into its territory,” Obama told reporters. “In fact, while I was having the conversation with Prime Minister Netanyahu, sirens went off in Tel Aviv.”\n\nBut Obama said he made it clear that the United States and its allies were deeply concerned about the risk of further escalation and the loss of more innocent lives. U.S. Secretary of State John F. Kerry is working to support Egyptian mediation efforts and is prepared to travel to the region after additional consultations, Obama said.\n\nIsraeli officials say they send repeated warnings to residents before launching attacks in their areas. Netanyahu told Obama that he holds Hamas responsible for the harm done to civilians, accusing the group of using them as human shields, according to a statement from the prime minister's office.\n\nIsrael accepted an Egyptian cease-fire proposal this week that called on the parties to wind down the fighting and send negotiators to Cairo to hammer out a more permanent truce.\n\nBut Hamas leaders, who have found themselves increasingly isolated since the ouster of Egypt's Islamist president, Mohamed Morsi, said their fighters wouldn't back down until key demands are met. They include easing a crippling blockade on the impoverished territory, reopening border crossings into Israel and Egypt, and releasing their members jailed in the West Bank during recent sweeps spurred by the disappearance and slaying of three Israeli teens.",
                "title": "Israeli ground forces push deeper into Gaza Strip",
                "updated_at": {
                    "$date": "2014-08-05T19:43:28.754-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:30.273-0400"
                },
                "ext_url": "http://www.npr.org/blogs/thetwo-way/2014/07/18/332499370/israeli-ground-operation-in-gaza-continues",
                "image": "http://media.npr.org/assets/img/2014/07/18/israel-ground-718-001-ae0defa443cebf7f1bf6494ead44d750c96ed67f-s6-c30.jpg",
                "text": "This post was updated at 6:15 p.m. ET:\n\nU.N. Secretary-General Ban Ki-moon will travel to the Middle East on Saturday in hopes of finding a way to stop the fighting between Israel and Hamas.\n\n\"Israel has legitimate security concerns, and we condemn the indiscriminate rocket fire from Gaza into Israel that ended yesterday's temporary cease-fire,\" Jeffrey Feltman, deputy U.N. secretary-general for political affairs, told the Security Council on Friday. \"But we are alarmed by Israel's heavy response.\"\n\nThe Palestinian death toll is now 285, according to a Gaza health official, with more than 30 killed since Israel launched a ground offensive late Thursday.\n\nMore than 2,000 Palestinians have been injured. The homes of 1,890 families have been destroyed or rendered uninhabitable, according to the U.N. More than 48,000 people have been displaced.\n\nOne Israeli soldier was killed Friday. Staff Sgt. Eitan Barak — Israel's first military fatality in the conflict and second overall — was killed by friendly fire.\n\nRocket sirens sounded in Tel Aviv during a telephone conversation Friday between President Obama and Israeli Prime Minister Benjamin Netanyahu.\n\n\"No nation should accept rockets being fired into its borders,\" Obama told reporters at a White House briefing. \"I also made clear that the United States and our friends and allies are deeply concerned about the risks of further escalation and the loss of more innocent life.\"\n\n\"Netanyahu told Obama that Hamas was responsible for the harm done to Palestinian civilians in Gaza who are being used as human shields,\" according to the Jerusalem Post.\n\nIsraeli tanks and troops entered the Gaza Strip as part of a ground invasion late Thursday, heightening a conflict that so far had been restricted mainly to an air war with Hamas militants.\n\nNPR's Ari Shapiro, who is in Jerusalem, says that it's the first time in five years Israel has sent ground troops into a conflict.\n\nAmong the army's main targets are the tunnels running between Gaza and Israel. The military says it stopped 13 Hamas militants coming through a tunnel.\n\n\"We have to cut off the line that is entering Israel,\" Peter Lerner, a spokesman for the Israeli army, told Shapiro.\n\nNetanyahu told troops on Friday to remain ready for a significant expansion of the offensive. A military spokesman said Israel had begun to call up 18,000 reservists; that's in addition to the 50,000 who have been mobilized in recent days.\n\nNo sort of end-game has come into focus, Shapiro reported on All Things Considered. There's no peace agreement on the table. And while the military says its goal is Israeli security, it's not clear what that means.\n\nKhaled Meshal, the political leader of Hamas, told Agence France-Presse from his base in Qatar on Friday that the ground operation was \"bound to fail.\"\n\n\"What the occupier Israel failed to achieve through its air and sea raids, it will not be able to achieve with a ground offensive,\" he said.\n\n\"Both sides know this is a temporary incursion and will not resolve any larger political questions since Israel and Hamas don't negotiate with each other,\" writes NPR.org international editor Greg Myre.\n\nThe conflict began 11 days ago. Hamas has fired more than 1,500 rockets at Israel in that period, The Associated Press reported. Israel, the news agency said, has conducted about 2,000 airstrikes.\n\nAs we noted Thursday, Netanyahu's office instructed the army to prepare for the offensive after Hamas rejected a cease-fire proposal brokered by Egypt. But the two sides mostly observed a five-hour cease-fire Thursday to allow humanitarian aid to reach Gaza.\n\nThe latest tensions reached a flashpoint over the abductions and slayings of four teenagers — three Israelis and one Palestinian. Until then, Israel and Hamas had observed a truce since 2012.",
                "title": "Israeli Ground Operation In Gaza Continues : The Two-Way : NPR",
                "updated_at": {
                    "$date": "2014-08-05T19:43:30.273-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:31.892-0400"
                },
                "ext_url": "http://edition.cnn.com/2014/07/17/world/meast/mideast-crisis/",
                "image": "http://i2.cdn.turner.com/cnn/dam/assets/140717182745-gaza-mortars-fired-story-top.jpg",
                "text": "Gaza City (CNN) -- The Israeli military launched a ground operation into Gaza late Thursday and called an extra 18,000 reservists into the conflict with Hamas.\n\nPrime Minister Benjamin Netanyahu and Defense Minister Moshe Yaalon ordered the ground action to destroy tunnels from Gaza into Israeli territory, according to a statement from Netanyahu's media adviser.\n\nThirteen Hamas militants used a tunnel earlier Thursday to launch an attempted attack in Sufa, near an Israeli kibbutz, but were stopped by Israeli soldiers, the Israel Defense Forces reported.\n\nCNN's Wolf Blitzer asked Mark Regev, Netanyahu's spokesman, whether Israel planned to occupy Gaza for a long time.\n\nRegev didn't answer directly, but said Israel's goals are to \"diminish\" the Hamas military force and to show Hamas it cannot attack Israel with impunity.\n\n\"We have hit Hamas hard, and we will continue to hit Hamas hard,\" the Israel Defense Forces tweeted.\n\nHamas spokesman Fawzi Barhoum told CNN that \"the beginning of the Israeli ground invasion of Gaza is a dangerous step with unknown consequences. Israel will pay a heavy price for it.\"\n\nLater, appearing on Aqsa TV, Barhoum said, \"the resistance will confront the Israeli ground invasion and will defend the people of Gaza.\"\n\nHe said Hamas military forces are \"far stronger\" than in 2009 and 2012, when Hamas and Israel clashed.\n\nMilitants are prepared to capture Israel soldiers and use them to trade for some of 5,000 prisoners in Israeli jails, Barhoum said.\n\nCNN's Palestinian security sources said Israeli tanks have reached Abu Holeh and that Israeli troops are clashing with Hamas and Islamic Jihad fighters along the Kissufim road.\n\nAbu Holeh is about in the center of Gaza, said CNN reporter Ben Wedeman. If Israeli forces go from there to the sea they can split Gaza as they did during the 2009 ground operation, Wedeman said.\n\nWedeman said Israeli forces struck near a mosque in Gaza City's Zaitoun neighborhood, which has been pounded since start of bombing, with many casualties reported.\n\nKenneth Roth, executive director of Human Rights Watch, said Israeli bombs hit Wafa Hospital in Gaza while four patients were inside. Seventeen others had evacuated, he said.\n\nThe long-awaited ground operation follows one of the worst nights of fighting since the war began. That fighting began after a temporary cease-fire ended earlier in the day.\n\nThe Gaza Health Ministry said seven children were killed in three hours on Thursday.\n\nBefore the incursion, the IDF dropped leaflets in 14 areas of Gaza, urging residents to temporarily leave their homes.\n\nCNN reporter Ian Lee described the action: \"Periodic fire balls illuminate the sky over Gaza. We see rockets screech toward the sky. Minutes later we see an intercepting missile rise from the iron dome, reducing the rocket into confetti of light and fire.\n\n\"We've seen red tracer rounds fly across the horizon. The repetitive thud of naval guns echoes throughout the coastal strip.\"\n\nA 4-year-old girl was killed in an Israeli airstrike near the customs building in Khan Younis, Palestinian medical and security sources said, and another airstrike killed a 29-year-old man east of Khan Younis.\n\nAqsa TV reported that an Israeli was killed and another injured in shelling of Ashkelon and that seven Israeli soldiers were injured in an attack on a military location.\n\nAqsa TV also reported that Israeli gunboats near Beit Lahiya north of Gaza strip, fired at the homes of residents.\n\nPalestinian medical and security sources say 246 people have been killed in Gaza and more than 1,850 injured. Israel says one of its citizens has died.\n\nThe region has many depressing precedents when it comes to violence.\n\nIn recent decades, Palestinians launched two armed uprisings against Israel, known as Intifadas, that each went on for years.\n\nIn late 2008 and early 2009, Israel carried out airstrikes and then a ground offensive against Hamas in Gaza that killed hundreds of Palestinians. In November 2012, the two sides fought a bloody eight-day conflict that ended in a cease-fire.\n\nEgypt, which as been trying to broker a cease-fire, said Thursday, \"If Hamas had accepted the truce Palestinian lives could have been saved.\"\n\nEarlier, Palestinian Authority President Mahmoud Abbas and Arab League Secretary-General Nabil Al-Arabi held talks in Cairo aimed at reaching a cease-fire agreement.\n\nAn Israeli delegation also attended, leaving after several hours, the state-run al-Ahram news agency reported.\n\n\"I expect that we will reach an agreement very soon; the efforts of a cease-fire is to stop the bloodshed, killing and destruction in Gaza,\" said Nabil Shaath, an Abbas adviser and member of the central committee of the Palestine Liberation Organization.\n\nHe said negotiators were focusing on stopping bloodshed above all else. He said they would later discuss Hamas demands, including opening Gaza border crossings and freeing prisoners whose exit from jail was negotiated in exchange for the release of Israeli soldier Gilad Shalit.\n\n\"These are all legitimate demands by Hamas, but the priority is for an immediate cease-fire,\" Shaath said.\n\nHamas leaders had rejected an earlier Egyptian cease-fire proposal, saying they had not been consulted on the deal and complaining that it did not address their broader demands.\n\nEgypt is playing a large role in the talks despite its distrust of Hamas.\n\nLike Israel, Egypt considers Hamas a terror organization because of the group's roots in the Muslim Brotherhood, which Egypt's military-led government banned after the country's 2013 coup.\n\nDuring Thursday's temporary cease-fire, Gaza banks opened for the first time in 10 days. Residents poured into the streets.\n\nRed Cross officials visited hospitals and damaged houses to assess medical needs, and worked with local officials to fix water pipelines. Some work was also done to repair power lines, the United Nations said.\n\nAt least 10 to 15 trucks entered Gaza through the Karem Shalom border crossing once it opened at 1 p.m. (6 a.m. ET), according to Ra'ed Fatooh, the Palestinian official in charge of the crossing in Gaza.\n\nGoods were limited to medical supplies and basic foodstuffs such as rice, sugar, oil, canned food, flour and other basic goods, he said.\n\nFallout continued from the deaths the day before of four cousins ages 9 to 11 who died in an Israeli military strike on a Gaza beach.\n\nThe results of a preliminary investigation suggests the deaths were the result of a \"a tragic misidentification of the target,\" Regev told CNN.\n\n\"We didn't want to kill those four boys. That was not our intention,\" Regev said. \"I'd even say the opposite is true. Had we known that that missile was aimed at four young men like that we would have not sent the missile.\"\n\n\"Those children were not firing rockets, they were just playing,\" Hamas spokesman Sami Abu Zhuri told reporters Wednesday.\n\nRegev, however, said a legitimate Hamas target was nearby, highlighting what he called a \"complex combat environment\" in crowded Gaza City and surrounding areas.\n\nIsraeli officials say militants often use mosques, schools and other crowded places to hide rockets and other weapons.\n\nIsraeli military's 'knock on roof' warnings criticized by rights groups\n\nWar-scarred Gaza medical crews also in harm's way\n\nOpinion: A smart way out of the Gaza confrontation\n\nCNN's Ben Wedeman reported from Gaza City, and CNN's Ralph Ellis and Michael Pearson reported and wrote from Atlanta. CNN's Ali Younes, Jethro Mullen, Samira Abdelaziz, Kareem Khadder, Tim Lister, Ian Lee, Diana Magnay, Samira Said, Michael Schwartz, Salma Abdelaziz and Tal Heinrich also contributed to this report.",
                "title": "Israel launches ground operation into Gaza",
                "updated_at": {
                    "$date": "2014-08-05T19:43:31.892-0400"
                }
            }
        ],
        "title": "Israel initiates ground maneuver in Gaza Strip"
    },
    {
        "_id": {
            "$oid": "53e167632c243f694e1c5fdf"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:32.712-0400"
                },
                "ext_url": "http://www.thenews.com.pk/Todays-News-13-31747-Two-security-guards-gunned-down-in-Peshawar",
                "image": "http://www.thenews.com.pk/images/h1_11.jpg",
                "text": "PESHAWAR: The incidents of target killings are on the rise in the provincial capital as two security guards of the industrial estate in Hayatabad were gunned down on Sunday after the attackers apparently mistook them for policemen.\n\nâ\u0080\u009cThe security guards were performing duty at a barrier between Hayatabad and the Industrial Estate when they were attacked,â\u0080\u009d Superintendent of Police (SP), Cantonment, Mohammad Faisal Kamran, told The News. He said the guards were wearing police uniforms and the attackers might have mistaken them for cops.\n\nAn official of Rescue 1122 identified the slain guards as Imran and Akhtar Zaman.Most of the private guards at the Industrial Estate wear police uniform following a decision taken by the liaison committee of the industrialists and the police.\n\nThey are provided salary, uniform and ammunition by the industrialists, who have deployed these guards at various barriers to help the police maintain law and order in the estate that shares a boundary with the lawless Khyber Agency.\n\nThe guards have been deployed at the couple of barriers erected between Hayatabad and the Industrial Estate to keep a check on suspected elements. Following an increase in the attacks on the police in the city, the cops have been strictly directed to remain alert to counter any attack.\n\nâ\u0080\u009cThere will be covering parties with every police party to counter attack on them. One out of every three cops will be standing alert at some distance at a checkpost or police car,â\u0080\u009d said Faisal Kamran.\n\nHe said the policemen had been directed to wear bullet-proof jackets and helmets to minimise the casualties.Target killers have increased attacks on the police in the provincial capital, particularly at the Iftar time when majority of the cops are relaxed, a source said.\n\nThe source said informers of the attackers roam the city and notice checkposts where policemen are not standing alert. The source added that a recently intercepted call between the target killers disclosed that they had to get 11 more motorbikes for the group to collect information about the police checkposts.\n\nTwo attacks on police parties in Pishtakhara and Agha Mir Jani Shah caused the death of four policemen and injuries to seven others on Friday. A three kilogram bomb planted close to a police post in Hayatabad on Jamrud Road was also defused the same day.The provincial police force had planned armouring all its police patrolling vans, particularly the ones performing duty in villages close to the tribal areas to minimise the casualties in case of an attack. However, the project like many others suffered delays for several months while the police continue to suffer casualties.",
                "title": "Two security guards gunned down in Peshawar",
                "updated_at": {
                    "$date": "2014-08-05T19:43:32.712-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:35.137-0400"
                },
                "ext_url": "http://www.dailytimes.com.pk/national/21-Jul-2014/two-security-officials-killed-in-peshawar-attack",
                "image": "http://www.dailytimes.com.pk/assets/dailytimes/images/client/dailytimes_fb.jpg",
                "text": "\n\n\n\n\n\nPESHAWAR: At least two security guards were killed in firing by armed men in the capital city of Khyber Pakhtunkhwa on Sunday. The incident occurred near Hayatabad industrial estate when unidentified armed men waylaid the security guards stationed there and opened fire, resulting their deaths. The two guards died on the spot. Their bodies were moved to hospital for medico-legal formalities. SP Cantt area confirmed that the dead persons were security guards. Additional contingent of police force was summoned to the spot while law enforcers cordoned off the area to collect evidences.",
                "title": "Two security officials killed in Peshawar attack",
                "updated_at": {
                    "$date": "2014-08-05T19:43:35.137-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:37.822-0400"
                },
                "ext_url": "http://tribune.com.pk/story/738550/constant-onslaught-four-security-personnel-shot-dead-in-city-khyber/",
                "image": "http://i1.tribune.com.pk/wp-content/uploads/2014/07/738550-deadmurderkillcrimesceneMARIAMESSA-1405889125-784-640x480.jpg",
                "text": "Two khasad­ars were target­ed while they were return­ing home from work.\n\nAccording to Jamrud Assistant Political Agent Roshan Mehsud, khasadar officials Wahab Khan and Rehman Shah were heading home to Bar Qamaberkhel after duty hours. When they reached Charmaro, Shakas, unidentified motorcyclists opened fire at them.\n\nMehsud said the two officials sustained severe injuries and were rushed to a hospital. However, they could not survive the trip.\n\nPolitical Tehsildar Irshad Khan said the administration sent a contingent of the khasadar force to the crime scene and also conducted a search operation. No arrests had been made till the filing of this report.\n\nSeparately, two security guards were killed on the premises of the Hayatabad Industrial Estate, Peshawar.\n\nCantonment SP Faisal Kamran told The Express Tribune that both victims were private guards and were attacked by unidentified motorcyclists while they were on duty. As a result of the firing, Akhtar Zaman was killed on the spot, while Imran was left severely injured. Kamran added that the attackers managed to escape.\n\nBoth men were rushed to Hayatabad Medical Complex where Imran also succumbed to his injuries after battling for his life for about 15 minutes.\n\n“They belonged to a group of private guards who assist the police in safeguarding the industrial estate,” said Industrialists Association Peshawar President Malik Niaz while expressing his regret over the unfortunate incident.\n\n“This group was formed by industrialists about five years ago after an increase was reported in kidnapping cases from the estate in broad daylight.”\n\nNiaz added that the number of guards has been increased after a rise in recent extortion cases and attacks on industrial units. Their duty is to patrol the estate along with the police and man all entry and exit points, he said.\n\nMany well-known industrialists have been leaving Peshawar, along with their families, for Dubai and America recently after receiving threats and letters demanding millions of dollars in extortion.\n\nMeanwhile, Chief Minister Pervez Khattak condemned the murders of the two security guards at the industrial estate said a handout issued on Sunday evening.\n\nKhattak also announced financial compensation of Rs500,000 under the Shuhada Package for the “valiant guards who sacrificed their lives but did not allow miscreants to enter the industrial zone and cause damage to any installations there,” read the handout.\n\nKhattak directed authorities to immediately conduct an enquiry into the killings. The chief minister also prayed for the departed souls and sympathised with the aggrieved families.\n\nThe handout further stated that the provincial government is taking concrete steps to eliminate targeted killings of security officials and kidnapping for ransom.",
                "title": "Four security personnel shot dead in city, Khyber – The Express Tribune",
                "updated_at": {
                    "$date": "2014-08-05T19:43:37.822-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:39.278-0400"
                },
                "ext_url": "http://www.dawn.com/news/1120468/two-security-men-killed-in-peshawar",
                "image": "http://i.dawn.com/primary/2014/07/53cb95e84c5ef.jpg?r=427866939",
                "text": "Though the deceased were wearing police uniforms but officials of Hayatabad police station said that the victims were private staffers of the Industrial Estate who were sanctioned by police department. — File photo by AFP\n\nPESHAWAR: Unknown gunmen shot dead two security personnel deputed at Hayatabad Industrial Estate in Peshawar.\n\nThough the deceased were wearing police uniforms but officials of Hayatabad police station said that the victims were private staffers of the Industrial Estate who were sanctioned by police department.\n\nThe Hayatabad police station official Ihtisham said that both the slain men were private guards who performed sentry duties at the entrance of the industrial estate and their uniforms were provided by the police department.\n\nPolice said that three unidentified motor-cycle-riding gunmen opened fired on two security staffers when they were engaged in checking vehicles and while others were on their prayers break.\n\nOne of the guards died on the spot while the other died while being shifted to Hayatabad Medical Complex.",
                "title": "Two security men killed in Peshawar",
                "updated_at": {
                    "$date": "2014-08-05T19:43:39.278-0400"
                }
            }
        ],
        "title": "Attack on security guard in Peshawar, Pakistan"
    },
    {
        "_id": {
            "$oid": "53e1676c2c243f694e1c5fe0"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:40.428-0400"
                },
                "ext_url": "http://globalvoicesonline.org/2014/07/18/russia-ukraine-mh17-wikipedia/",
                "image": "http://globalvoicesonline.org/wp-content/uploads/2014/07/bombsaway-800x461.jpg",
                "text": "A day after a horrific plane crash in eastern Ukraine claimed the lives of nearly 300 people, speculation about who is to blame for shooting down the aircraft is in full swing. Leaders of Ukraine, Russia, and even the separatists in Donetsk have all placed responsibility on each other. In Kyiv, President Poroshenko blamed rebels in the east and criticized Russia for destabilizing the border. In Moscow, Vladimir Putin claimed that Kyiv is accountable for anything that happens in Ukraine. Donetsk’s putative leader denies any role in the attack on Malaysian Flight MH17, saying it must have been the Ukrainian Air Force.\n\nUnsurprisingly, the blame game is now playing out on Wikipedia, where editors battle to record the polemics that best reflect their side of the story. Earlier this morning, the Russian-language Wikipedia entry for commercial aviation accidents hosted one such skirmish, when someone with an IP address based in Kyiv edited the MH17 record to say that the plane was shot down “by terrorists of the self-proclaimed Donetsk People’s Republic with Buk system missiles, which the terrorists received from the Russian Federation.” Less than an hour later, someone with a Moscow IP address replaced this text with the sentence, “The plane was shot down by Ukrainian soldiers.”\n\nThanks to a Twitter bot that tracks anonymous Wikipedia edits made from IP addresses used by the Russian government, we know that the second edit to the MH17 article came from a computer at VGTRK, the All-Russia State Television and Radio Broadcasting Company.\n\nVGTRK is the home of Dmitri Kiselyov, who is known informally as the Kremlin’s chief propagandist. Kiselyov is notorious for his strong criticisms of the governments in Kyiv and Washington. During the Crimean crisis, Kiselyov once boasted on television that Russia remains “the only country in the world capable of turning the USA into radioactive dust.” In June, two VGTRK journalists were killed near Luhansk after coming under mortar fire while embedded with local rebels. Nadiya Savchenko, the helicopter pilot whom separatists captured in Ukraine and transferred to Voronezh earlier this month, now sits in a Russian detention center, accused of participating in the attack that killed the VGTRK reporters.\n\nThe Twitter account that discovered VGTRK’s Internet activity, @RuGovEdits, is modeled on another bot, @CongressEdits, which tracks Wikipedia edits made from IP addresses in the US Congress. The code for CongressEdits, created by programmer Ed Summers, is open-source software and can be configured easily to watch for anonymous edits from any IP ranges.",
                "title": "Russian State TV Edits Wikipedia to Blame Ukraine for MH17 Crash · Global Voices",
                "updated_at": {
                    "$date": "2014-08-05T19:43:40.428-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:46.768-0400"
                },
                "ext_url": "http://www.theage.com.au/it-pro/government-it/russian-media-uses-wikipedia-to-blame-mh17-on-ukraine-20140719-zurmd.html",
                "image": "http://r3.whistleout.com.au/public/images/deals/widget_330x190_0714_voda_data_b.jpg",
                "text": "Zoom in on this story . Explore all there is to know.\n\nThe Russian government has reportedly been caught editing a Wikipedia page relating to crashed Malaysia Airlines flight MH17 and removing references to Russian involvement.\n\nThe London Telegraph reports that a Russian-language Wikipedia page about civil aviation accidents was edited from within the government-run All-Russia State Television and Radio Broadcasting Company.\n\nThe user wrote that \"the plane [flight MH17] was shot down by Ukrainian soldiers\".\n\nThat replaced an entry written just an hour earlier that said the plane had been shot down by â\u0080\u009cterrorists of the self-proclaimed Donetsk People's Republic with Buk system missiles, which the terrorists received from the Russian Federation.\"\n\nThe edits were uncovered by @RuGovEdits, a Twitter bot that automatically tweets every time Wikipedia is edited from a computer with a Russian government IP address.\n\nAn IP address is a unique number related to certain computers or networks.\n\nAll edits made to Wikipedia are permanently logged along with the editorâ\u0080\u0099s username and IP address.\n\nA similar Twitter bot set up earlier in July to monitor Wikipedia edits made from computers inside the United States Congress, @congressedits, has uncovered edits ranging from the banal to the bizarre.\n\nThis includes edits improving grammar on an article about the dance movie Step Up 3D and adding US President Barack Obama to an entry about horse-head masks, technology website Gizmodo reports.",
                "title": "Russian media uses Wikipedia to blame MH17 on Ukraine",
                "updated_at": {
                    "$date": "2014-08-05T19:43:46.768-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:48.866-0400"
                },
                "ext_url": "http://www.telegraph.co.uk/technology/news/10977082/Russian-government-edits-Wikipedia-on-flight-MH17.html",
                "image": "http://i.telegraph.co.uk/multimedia/archive/02978/Malaysia-Airlines-_2978975k.jpg",
                "text": "A political battle has broken out on Wikipedia over an entry relating to the crash of Malaysian Airlines flight MH17, with the Russian government reportedly removing sections which accuse it of providing \"terrorists\" with missiles that were used to down the civilian airliner.\n\nA Twitter bot which monitors edits made to the online encyclopaedia from Russian government IP addresses (unique numbers relating to certain computers or networks) has spotted that changes are being made to a page relating to the crash.\n\nIt appears that an internet user from within the All-Russia State Television and Radio Broadcasting Company (VGTRK) changed a Russian language version of a page listing civil aviation accidents to say that \"The plane [flight MH17] was shot down by Ukrainian soldiers\".\n\nThat edit replaced text – written just an hour earlier - which said MH17 had been shot down \"by terrorists of the self-proclaimed Donetsk People's Republic with Buk system missiles, which the terrorists received from the Russian Federation.\"\n\nAll edits to Wikipedia are permanently logged, with the username and IP address being stored along with the changes they have made.\n\nAn automated Twitter bot called congress-edits was created to monitor for changes made from US Congress computers and immediately tweet them. The source code powering that project was released to the public, allowing the creation of RUGovEdits which performs a similar role in Russia.\n\nA tweet today from that account, translated into English, says: \"Wikipedia article List of aircraft accidents in civil aviation has been edited by RTR [another name for VGTRK]\".\n\nFlight MH17 crashed in Ukraine on Thursday, on the border with Russia, with 298 people on board. There were no survivors.\n\nUkraine's interior ministry says the plane was shot down by a missile, while President Obama on Friday afternoon also said that it was likely to have been targeted by separatists.\n\nMr Obama said that the US does not “want to get ahead of the facts” but added: “A group of separatists cannot shoot down military planes without sophisticated equipment - and that is coming from Russia.”\n\nRussian President Vladimir Putin has denied any responsibility, however, telling advisers on Friday that: “certainly, the government over whose territory it occurred is responsible for this terrible tragedy.”\n\nIf the Russian government has indeed edited the page it will be far from the first time that politically or commercially embarrassing Wikipedia updates have been exposed.\n\nIn 2006 United States Congressional staff were found to have edited articles about members of Congress, Microsoft once offered an engineer money to update articles on two competing standards, PR firm Bell Pottinger tweaked articles about its clients and, in 2012, MPs were discovered to have asked their staff to remove criticism about them.",
                "title": "Russian government edits Wikipedia on flight MH17",
                "updated_at": {
                    "$date": "2014-08-05T19:43:48.866-0400"
                }
            }
        ],
        "title": "Russian government edits Wikipedia to blame Ukraine for MH17 crash"
    },
    {
        "_id": {
            "$oid": "53e1677b2c243f694e1c5fe1"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:50.488-0400"
                },
                "ext_url": "http://online.liebertpub.com/doi/abs/10.1089/ast.2014.1171",
                "image": "",
                "text": "The climate and, hence, potential habitability of a planet crucially depends on how its atmospheric and ocean circulation transports heat from warmer to cooler regions. However, previous studies of planetary climate have concentrated on modeling the dynamics of atmospheres, while dramatically simplifying the treatment of oceans, which neglects or misrepresents the effect of the ocean in the total heat transport. Even the majority of studies with a dynamic ocean have used a simple so-called aquaplanet that has no continental barriers, which is a configuration that dramatically changes the ocean dynamics. Here, the significance of the response of poleward ocean heat transport to planetary rotation period is shown with a simple meridional barrier—the simplest representation of any continental configuration. The poleward ocean heat transport increases significantly as the planetary rotation period is increased. The peak heat transport more than doubles when the rotation period is increased by a factor of ten. There are also significant changes to ocean temperature at depth, with implications for the carbon cycle. There is strong agreement between the model results and a scale analysis of the governing equations. This result highlights the importance of both planetary rotation period and the ocean circulation when considering planetary habitability. Key Words: Exoplanet—Oceans—Rotation—Climate—Habitability. Astrobiology 14, xxx–xxx.",
                "title": "The Importance of Planetary Rotation Period for Ocean Heat Transport",
                "updated_at": {
                    "$date": "2014-08-05T19:43:50.488-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:51.051-0400"
                },
                "ext_url": "http://www.eurekalert.org/pub_releases/2014-07/uoea-urs071814.php",
                "image": "http://www.eurekalert.org/images/eurekalert-logo200X200.gif",
                "text": "Researchers at the University of East Anglia have made an important step in the race to discover whether other planets could develop and sustain life.\n\nNew research published today in the journal Astrobiology shows the vital role of oceans in moderating climate on Earth-like planets.\n\nUntil now, computer simulations of habitable climates on Earth-like planets have focused on their atmospheres. But the presence of oceans is vital for optimal climate stability and habitability.\n\nThe research team from UEA's schools of Maths and Environmental Sciences created a computer simulated pattern of ocean circulation on a hypothetical ocean-covered Earth-like planet. They looked at how different planetary rotation rates would impact heat transport with the presence of oceans taken into account.\n\nProf David Stevens from UEA's school of Maths said: \"The number of planets being discovered outside our solar system is rapidly increasing. This research will help answer whether or not these planets could sustain alien life.\n\n\"We know that many planets are completely uninhabitable because they are either too close or too far from their sun. A planet's habitable zone is based on its distance from the sun and temperatures at which it is possible for the planet to have liquid water.\n\n\"But until now, most habitability models have neglected the impact of oceans on climate.\n\n\"Oceans have an immense capacity to control climate. They are beneficial because they cause the surface temperature to respond very slowly to seasonal changes in solar heating. And they help ensure that temperature swings across a planet are kept to tolerable levels.\n\n\"We found that heat transported by oceans would have a major impact on the temperature distribution across a planet, and would potentially allow a greater area of a planet to be habitable.\n\n\"Mars for example is in the sun's habitable zone, but it has no oceans \u0096 causing air temperatures to swing over a range of 100OC. Oceans help to make a planet's climate more stable so factoring them into climate models is vital for knowing whether the planet could develop and sustain life.\n\n\"This new model will help us to understand what the climates of other planets might be like with more accurate detail than ever before.\"\n\n'The Importance of Planetary Rotation Period for Ocean Heat Transport' is published in the journal Astrobiology on Monday, July 21, 2014. The research was funded by the Engineering and Physical Sciences Research Council (EPSRC).\n\n\n\nAAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert! system.",
                "title": "UEA research shows oceans vital for possibility for alien life",
                "updated_at": {
                    "$date": "2014-08-05T19:43:51.051-0400"
                }
            }
        ],
        "title": "Researchers show how planetary rotation affects habitability of Earth-like planets"
    },
    {
        "_id": {
            "$oid": "53e167812c243f694e1c5fe2"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:52.156-0400"
                },
                "ext_url": "http://www.theguardian.com/world/2014/jul/21/gaza-crisis-obama-ceasefire-fighting-goes-on",
                "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/21/1405957717287/c08fece1-8f1b-4641-9b5b-3c053366676e-460x276.jpeg",
                "text": "As the death toll in Gaza passes 500, UN chief Ban Ki-moon calls on Israel to 'exercise maximum restraint' and spare civilian lives\n\nThe Palestinian death toll in the conflict between Hamas and Israel reached 548 on Monday as officials said four were killed when a Gaza hospital was hit by Israeli fire.\n\nIt followed the bloodiest day of the conflict so far on Sunday when at least 120 Palestinians were killed in Shujai'iya, a third of them women and children. Thirteen Israeli soldiers were also killed – two of them US citizens – in the heaviest loss of life for the Israeli military in years.\n\nStaff at the al-Asqa Martyrs hospital were said to be in shock that the building was hit. \"People can't believe this is happening – that a medical hospital was shelled without the briefest warning. It was already full with patients,\" said Fikr Shalltoot, director of programmes at Medical Aid for Palestinians in Gaza city.\n\n\"Five people, I gather, were killed, and 15 were injured, including medical staff. I know the staff very well. My nephew is a medical doctor there.\"\n\nThe US president, Barack Obama, has called for an immediate ceasefire between Israel and Hamas.\n\nIsrael continued its action on the Gaza City neighbourhood of Shujai'iya on Monday, where bombardment and fierce fighting on the ground the day before had left shattered streets littered with bodies.\n\n\n\nMounting international pressure for a ceasefire came amid continuing violence in Gaza. Overnight, Israeli strikes hit Gaza city, and the south and centre of the coastal enclave, home to 1.8 million people.\n\n\n\nTwenty-five members of the same family were reported killed in an air strike in the south of Gaza, and a further 10 people were killed near Khan Younis.\n\nIn the West Bank, Palestinians began three days of mourning for the dead in Gaza. A general strike was under way on Monday.\n\nThe Israel Defence Forces said it had foiled attempts by Hamas fighters to infiltrate Israel through two tunnels from Gaza on Monday. Ten militants were killed in air strikes. The IDF also suffered casualties, Israel Radio reported.\n\nMeanwhile, army spokesman Peter Lerner said the IDF could not rule out the kidnapping of an Israeli soldier by Hamas, despite denials late on Sunday by the Israeli ambassador to the UN, Ron Prosor. Investigations were continuing, the IDF said.\n\nBy Monday morning, 43 access points to 16 different tunnels had been discovered by Israeli troops on the ground. Military sources said the “sophisticated network of tunnels” within Gaza and under the border to Israel was much more extensive that originally thought.\n\nThe conflict is rapidly threatening to turn into a major humanitarian crisis hitting electricity and water supplies and seeing large numbers driven from their homes. The UN agency for Palestinian refugees, UNRWA, has opened 60 of its schools to shelter more than 83,000 people who have fled so far.\n\nObama's appeal came as the United Nations security council opened urgent talks on efforts to strike a ceasefire deal as Israel ramped up a major military offensive with fresh strikes on Monday in the Palestinian territory.\n\n\n\n\"The members of the security council expressed serious concern about the growing number of casualties. The members of the security council called for an immediate cessation of hostilities,\" Rwandan UN ambassador Eugene Gasana told reporters after an emergency meeting of the 15-member council.\n\nAmid signs of mounting pressure on both sides to end the conflict, the UN secretary general, Ban Ki-moon, who is in the Middle East in an attempt to help broker a ceasefire, condemned the Israeli assault in Shuji'iya as an \"atrocious action\".\n\nThe call of a halt to the fighting came as the US secretary of state, John Kerry, was due to fly to Cairo on Monday for meetings with senior officials from Egypt and other countries, as diplomatic efforts to end the two-week long conflict appeared to be gaining some momentum.\n\nThe state department said Kerry would leave early on Monday for Egypt where he will join diplomatic efforts to resume a truce that had been agreed to in November 2012.\n\nIn a statement on Sunday evening, department spokeswoman Jen Psaki said the US and its international partners were \"deeply concerned about the risk of further escalation, and the loss of more innocent life\".\n\nCeasefire discussions between Hamas leader Khaled Meshaal and the Palestinian president were due to take place on Monday after being delayed by a day.\n\nUN chief Ban was also in Doha where he urged Israel to \"exercise maximum restraint\".\n\n\"Too many innocent people are dying … [and] living in constant fear,\" he told a news conference in Doha.\n\nSpeaking to the Israeli prime minister, Binyamin Netanyahu, by telephone early on Monday, Obama expressed his concern over the deaths on both sides, the White House said in a statement.\n\nIn their second call in three days, Obama \"reaffirmed Israel's right to defend itself\" and called for an immediate ceasefire in Gaza.\n\nDavid Cameron also spoke to Netanyahu, reiterating \"the UK's strong support for Israel's right to take proportionate action to defend itself from\" Gaza rockets, while expressing condolences over the Israeli deaths and concern over the \"mounting civilian casualties in Gaza\".\n\nCameron agreed with Netanyahu that the way out of the \"spiral of violence\" was through the Egyptian ceasefire initiative, a spokesman for the British PM said.\n\nSo far, truce efforts have been rejected by Hamas, which has pressed on with its own attacks, undaunted by the Israeli bombardment by land, sea and air.\n\nThe Doctors Without Borders charity urged Israel to \"stop bombing civilians trapped in the Gaza Strip\", noting the majority of the injured arriving in the Al-Shifa hospital were women and children.\n\n\"While the official line is that the ground offensive is aimed at destroying tunnels, what we see on the ground is that bombing is indiscriminate and that those who are dying are civilians,\" the French NGO said in a statement.",
                "title": "Gaza crisis: Palestinian death toll climbs past 500 as hospital is hit",
                "updated_at": {
                    "$date": "2014-08-05T19:43:52.156-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:53.081-0400"
                },
                "ext_url": "http://uk.reuters.com/article/2014/07/21/uk-palestinians-israel-un-statement-idUKKBN0FQ05X20140721",
                "image": "",
                "text": "UNITED NATIONS (Reuters) - The U.N. Security Council expressed concern at the escalation of violence in the Gaza conflict after meeting on Sunday to discuss almost two weeks of fighting between Israel and the Islamist Hamas group that has cost more than 400 lives. \"The members of the Security Council expressed serious concern about the growing number of casualties. The members of the Security Council called for an immediate cessation of hostilities,\" Rwandan U.N. Ambassador Eugene Gasana told reporters after an emergency meeting of the 15-member council.\n\nJordan had requested the meeting after more than 60 Palestinians and 13 Israeli soldiers were killed as Israel shelled Gaza's Shejaia neighbourhood and battled militants in the bloodiest fighting in the 13-day offensive.\n\n\"The members of the Security Council called for respect of international humanitarian law including protection of civilians,\" Gasana said. \"The members of the Security Council emphasized the need to improve the humanitarian situation, including through humanitarian pauses.\"\n\nU.N. Secretary-General Ban Ki-moon, who is in the Middle East in a bid to help broker a ceasefire, condemned the killings in Shejaia as an \"atrocious action\" and called for an immediate end to the fighting.\n\nBan was in Qatar on Sunday and is due to visit Cairo, Jerusalem and Ramallah in the West Bank.\n\nOn July 12 the Security Council called for a ceasefire between Palestinians and Israelis and expressed serious concern about the welfare and protection of civilians on both sides.\n\nThe United States, a close ally of Israel, agreed to the statement after the Arab Group threatened to push for a resolution.",
                "title": "UN Security Council concerned by growing Gaza conflict casualties",
                "updated_at": {
                    "$date": "2014-08-05T19:43:53.081-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:54.580-0400"
                },
                "ext_url": "http://www.reuters.com/article/2014/07/21/us-palestinians-israel-idUSKBN0FP00U20140721",
                "image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20140721&t=2&i=940722901&w=&fh=&fw=&ll=580&pl=378&r=LYNXMPEA6K0Q4",
                "text": "Despite growing calls for a halt to two weeks of fighting, violence raged on. Israel pounded the coastal strip, killing 28 members of a family in one strike, 11 people in an attack on a high-rise building and four in the shelling of a hospital, medics said.\n\nIsrael's losses also mounted. Following the death of 13 soldiers on Sunday, Israel said seven more troops had been killed on Monday, including four whose jeep was fired at by a group of militants who tunnelled across the border from Gaza.\n\nIsraeli aircraft hit back swiftly, killing 10 of the infiltrators from the Islamist group Hamas, the army said.\n\nViolence also spread to the occupied West Bank where Palestinian medics said Israeli soldiers shot and killed a Palestinian man, 21, while dispersing protesters throwing stones at a military jeep near Jerusalem.\n\nThe Israeli military said it was investigating the incident.\n\nU.S. Secretary of State John Kerry arrived in Cairo to try to secure an end to hostilities, a day after he was caught by an open microphone saying sarcastically that the Israeli assault was \"a hell of a pinpoint operation\".\n\nSpeaking in Washington, President Barack Obama said he was increasingly worried by the conflict.\n\n\"We have serious concerns about the rising number of Palestinian civilian deaths and the loss of Israeli lives, and that is why it now has to be our focus and the focus of the international community to bring about a ceasefire,\" he told reporters at the White House.\n\nHamas, which killed 13 Israeli soldiers in Gaza on Sunday, said it would not lay down its arms until a series of demands were met - including an end to a blockade imposed on the territory by both Israel and Egypt.\n\n\"The world must understand that Gaza has decided to end the blockade by its blood and its heroism,\" deputy Hamas leader Ismail Haniyeh said in a televised address.\n\nAt Al-Aqsa hospital in the central Gaza Strip, four people were killed and 70 wounded when an Israeli tank shell slammed into the third floor, which housed operating theatres and an intensive care unit, the Health Ministry said.\n\nThe Israeli military, which has accused Hamas militants of firing rockets from the grounds of Gaza hospitals and seeking refuge there, had no immediate comment.\n\nThe International Committee of the Red Cross issued a statement condemning the shelling of the hospital \"in the strongest terms\". It said the hospital came under direct fire at least four times and life-saving equipment had been severely damaged.\n\nNonstop attacks lifted the Palestinian death toll to 536, including almost 100 children, since fighting started on July 8, Gaza health officials said. Israel says 25 of its soldiers have been killed along with two civilians.\n\nHamas announced late on Sunday it had captured an Israeli soldier in Gaza, displaying a photo ID card and serial number, but no image of the man in its hands. The Israeli army said it was still investigating the allegation.\n\nThe Hamas announcement set off rejoicing in the embattled Gaza Strip.\n\n\"This is not the time to talk of a ceasefire,\" said Gilad Erdan, communications minister and a member of Israeli Prime Minister Benjamin Netanyahu's inner security cabinet.\n\n\"We must complete the mission, and the mission cannot end until the threat of the tunnels is removed,\" he told reporters.\n\nLooking to take the fight onto Israeli soil, two groups of Palestinian fighters, dressed as Israeli soldiers, crossed from Gaza via a secret tunnel in the early morning, firing a rocket-propelled grenade at a military jeep.\n\n\"We paid a heavy price but we prevented a major attack on our communities,\" said Major-General Sami Turgeman, Israel's military commander in the south.\n\nBlack-and-white surveillance footage supplied by the army showed one group of five or six men crouching and firing in tall grass. Seconds later they were hit by a large explosion, which sent a cloud of smoke and debris flying into the air.\n\nFighters from Hamas, which controls Gaza, and its allies have repeatedly tried to infiltrate Israel over the past week through a vast network of hidden tunnels, looking to attack villages and army encampments that dot the border area.\n\nNetanyahu sent in Israeli ground forces on Thursday to destroy the tunnels and the militants' missile stockpile.\n\n\"Our fighters want to prove that Gaza is a graveyard for the invaders and Gaza is unbreakable,\" Haniyeh said on television.\n\nIsraeli military spokesman Lieutenant-Colonel Peter Lerner told reporters that the main focus of fighting remained the Shejaia district, east of Gaza City, where some 72 Palestinians, many of them civilians, were killed on Sunday.\n\nIn its push into Shejaia, Israel suffered its worst losses in the offensive, with the 13 soldiers killed on Sunday marking the army's heaviest one-day loss in battle since 2006.\n\nThe carnage energised world leaders to step up efforts to find a way out of the confrontation but a rift among Arab powers may complicate the quest for a truce.\n\nPast conflicts between Israel and its foes in Gaza and Lebanon have usually ended when the United States, the Jewish state's guardian ally, calls a halt, sometimes hastened by a strike that inflicts high civilian casualties on the Arab side.\n\nKerry was scheduled to meet U.N. Secretary-General Ban Ki-moon on Monday night and to see a series of senior Egyptian officials on Tuesday.\n\nEgypt presented a ceasefire plan last week. Israel accepted, but Hamas rejected it, saying the group had not been consulted.\n\nEgyptian officials told Reuters on Monday that Cairo might be willing to amend its truce initiative. An Israeli official in Washington, who declined to be named, said he wanted Kerry to get Egypt to apply pressure on Hamas.\n\n\"The secretary has to try and strengthen the Egyptian proposal,\" the official said. \"I think Egypt has considerable amount of leverage with Hamas because they are the ones that have the chokehold\" on Gaza's economy.\n\nWhile Washington has called for calm, it has so far defended Israeli actions. In Israel, the high death toll by Israeli standards appeared to cement a public mood of grim determination. Many flags flew at half-mast but no leading figures are calling into question the operation. \"We need to continue to grit our teeth, to shut our ears, to ignore the background noise and to get the job done,\" columnist Ben Caspit wrote in Ma'ariv.",
                "title": "Gaza death toll tops 500 as U.S. steps up ceasefire efforts",
                "updated_at": {
                    "$date": "2014-08-05T19:43:54.580-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:56.912-0400"
                },
                "ext_url": "http://www.theguardian.com/world/2014/jul/20/gaza-bloodiest-day-assault-kills-palestinians-israelis-hospitals",
                "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/20/1405884998228/Israeli-ground-operation--011.jpg",
                "text": "Gaza endured the bloodiest day of the two-week conflict between Hamas and Israelon Sunday, with an Israeli assault in a residential area causing carnage described by the Palestinian leadership as a \"heinous massacre\" and a \"war crime\" by the Arab League.\n\nAt least 100 Palestinians were killed – 67 in one area – as Israel escalated its military onslaught overnight. The corpses of women and children were strewn in streets of Shujai'iya as people fled on foot and packed into vehicles.\n\nThe UN security council was holding an emergency meeting on Sunday night in New York at the request of Jordan to discuss the worsening situation in Gaza.\n\nA Jordan-drafted resolution obtained expressed \"grave concern\" at the high number of civilians killed in Gaza, including children, and it called for an immediate cease-fire, \"including the withdrawal of Israeli occupying forces from the Gaza Strip\".\n\nOn Sunday, night, a spokesman for Hamas's armed wing claimed that the group had captured an Israeli soldier during fighting in Gaza. But Israel's UN ambassador Ron Prosor said in New York on Sunday night that there was no kidnapped Israeli soldier. \"Those rumours are untrue,\" he said.\n\nDuring the course of Sunday 13 Israeli soldiers were killed – a dramatic rise in casualties that could increase pressure inside Israel for an end to the fighting, or harden determination to inflict a decisive blow on Hamas.\n\nHospitals in Gaza were overwhelmed by the injured and terrified seeking sanctuary from a relentless bombardment from air, sea and tanks, as gun battles raged on the ground between Israeli soldiers and Hamas militants.\n\nEarly on Monday morning, the UN security council was due to hold an emergency meeting to discuss the conflict, at the request of Jordan.\n\nThe Palestinian government described the bloodshed in Shujai'iya as a \"heinous massacre\" and called on the international community to intervene immediately to stop the \"Israeli aggression\", while the Arab League described the shelling as \"a war crime against Palestinian civilians and a dangerous escalation\".\n\nBut condemnation from international leaders was muted. Amid floundering efforts to start meaningful ceasefire talks, there was little sign of real pressure on Israel to lessen or halt the killing of civilians. Barack Obama raised \"serious concern\" about the growing number of Palestinian casualties in a phone conversation on Sunday night with Israel's prime minister, Binyamin Netanyahu.\n\nAt a televised press conference, Netanyahu warned Israel's operation would continue, saying after three ceasefire offers, it now had international backing for its ground offensive: \"We will continue this operation for as long as it takes.\"\n\nMore than 425 Palestinians – mostly civilians – have been killed and about 3,000 injured.\n\nTwenty Israelis, including two civilians, have died, including two Americans fighting with the Israel Defense Force.\n\nStuart Steinberg confirmed the death of his 24-year-old son, Max Steinberg, on Sunday. Steinberg, whose family lives in California, was a sharpshooter for the Golani Brigade and was one of 13 men killed in fighting Saturday. The second American was named as 21-year-old Sgt Nissim Sean Carmeli from Texas.\n\nIn a CNN interview, Netanyahu accused Hamas leaders of using civilians as human shields. He called them \"genocidal terrorists\" with a callous disregard for civilian casualties. \"They use telegenically dead Palestinians for their cause. They want the more dead, the better,\" he said.\n\nHe said Israel did not want \"to go to excessive lengths\" while insisting that its forces would take \"whatever action is necessary\" to stop rocket fire from Gaza. \"We try to target military targets and unfortunately there are civilian casualties which we regret and we don't seek,\" he said.\n\nAfter praising Netanyahu for a \"pinpointed\" operation and restating America's commitment to Israel's right to defend itself, an apparently frustrated US secretary of state, John Kerry, was caught on a Fox News microphone telling an aide sarcastically: \"It's a hell of a pinpointed operation.\"\n\nAs the bombardment intensified, the Israeli military declined to deny it was using flechette shells in Gaza, saying only that it adhered to international law and flechette munitions were permitted under the law of armed conflict. Flechette shells spray out thousands of potentially lethal tiny metal darts with sharpened tips, which can shred flesh.\n\nThe Red Cross appealed for a humanitarian ceasefire for two hours on Sunday afternoon, to allow the evacuation of the dead and injured. The truce broke down after an hour – with both sides accusing the other of breaches – but resumed later. The Israelis told Palestinians to use the pause in bombing to leave homes in vulnerable areas.\n\nThe UN agency for Palestinian refugees, UNRWA, said more than 63,000 people had sought sanctuary in the 49 shelters it has opened in Gaza, and that it expected this figure to rise. \"The number has tripled in the last three days, reflecting the intensity of the conflict and the inordinate threats the fighting is posing to civilians. We call on all sides to exercise maximum restraint and to adhere to obligations under international law to protect civilians and humanitarian workers,\" said a spokesman, Chris Gunness.\n\nShawan Jabarin of the Palestinian human rights organisation Al-Haq warned that Israel's assault on residential areas in Gaza, resulting in high and rising civilian deaths, could constitute war crimes.\n\n\"Throughout this latest escalation of attacks, as with Operation Cast Lead and Operation Pillar of Defence, we see a disproportionate number of civilian deaths and damage to civilian property. The obligation not to target civilians and civilian infrastructure is absolute and any intentional violation of this obligation amounts to a war crime.\"\n\nAttempts to broker a durable ceasefire agreement continued in Doha, where the Palestinian president, Mahmoud Abbas, was due to meet Hamas's leader-in-exile, Khaled Mishal.\n\nBan Ki-moon, the UN secretary general, was also flying to Doha for a round of emergency talks. Ban was due to meet the emir, Sheikh Tamim bin Hamad al-Thani, and Abbas. Qatar's close links to Hamas make it uniquely placed to try to mediate in the conflict.\n\nOn Monday, Ban will move to Cairo to meet President Abdel-Fatah al-Sisi, author of a ceasefire plan already rejected by Hamas. Hamas said Mishal had also been invited to Cairo.\n\nKerry will fly to Cairo on Monday to add his weight to the peace efforts, after reiterating concern over the risk of further escalation. In a conversation with his aide inadvertently recorded by Fox News, he said: \"We've got to get over there ... I think we ought to go tonight. I think it's crazy to be sitting around.\"\n\nQatar's role as mediator is being enhanced by the deep hostility of Egypt's government to Hamas, which has close links to the now-banned Muslim Brotherhood. According to the Israeli daily Haaretz, a key element of the Egyptian initiative – rejected by Hamas – is the return of Abbas's Palestinian Authority to Gaza, for the first time since Hamas's 2007 takeover of the territory.\n\nHamas is demanding an end to the Israeli blockade of Gaza, an opening of the border with Egypt and a release of scores of recently re-arrested prisoners by Israel.\n\nThe Israeli military said it had \"neutralised\" two Palestinian militants who \"emerged from a tunnel\" in southern Israel on Sunday as Hamas continued to fire rockets into Israel, most of which were intercepted by its anti-missile system. Israel soldiers have uncovered 34 shafts leading into about a dozen underground tunnels, some as deep as 30 metres. Israel has said demolishing tunnels is the principal goal of its ground operation.",
                "title": "Gaza's bloodiest day as at least 100 Palestinians are killed",
                "updated_at": {
                    "$date": "2014-08-05T19:43:56.912-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:58.052-0400"
                },
                "ext_url": "http://www.theguardian.com/world/2014/jul/20/israeli-attack-suburb-gaza-city-palestinians-shujaiiya",
                "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/20/1405877822270/A-injured-Palestinian-wom-009.jpg",
                "text": "Al-Beltaji Street, off the main road in Shujai'iya, is a scene of utter devastation – the site of Israel's bloodiest assault in almost two weeks of fighting in the coastal strip.\n\nAn ambulance sat on shot-out tyres, shrapnel punched through its sides. A charred car lay flattened as if by a giant hand. Smoke rose from one end of the street in a dark billowing curtain.\n\nFallen trees, tangled electricity cables and drifts of rubble covered the road, smashed, chopped and torn apart by Israeli shells and bombs that slammed into this Gaza City district at a rate of one every five seconds on Saturday night and the early hours of Sunday.\n\nA body was carried out of a ruined house, then a second and a third – seven in total from buildings within a hundred metres of each other during a brief agreed lull in the fighting to evacuate the dead and wounded. A little further along, bodies lay in the street where they had fallen, mostly scorched figures – one still in a yellow dressing gown – others missing limbs.\n\n\"Come out it's safe,\" rescue officials shouted as they picked their way along the street.\n\nAt least 67 people – some fighters but many civilians – were killed in a night of intense violence in Shujai'iya that has been described by the Palestinian president, Mahmoud Abbas, as a massacre. Hundreds more were injured.\n\nAt the far end of the street, a family emerged running, led by a man cradling a child. Slowed at times by the rubble, their faces, stunned by fear, were deaf to questions, focused only on reaching the road leading to the relative safety of Gaza's City centre.\n\nRaed Zaqtout fled at 10am on Sunday morning, but returned with his brother in the midst of a two-hour humanitarian ceasefire organised by the Red Cross to retrieve the dead and the injured. The ceasefire only lasted an hour.\n\n\"We stayed in the house while they were shelling. Two other families came to shelter with us. In the morning we decided to escape along that lane,\" he said, pointing to an opening opposite. \"Even then some of us were injured, thankfully only lightly, by shrapnel.\"\n\nBoth sides have accused the other of breaking the ceasefire. An Israeli military spokesman conceded that during the brief initial pause in fire, Israeli forces had continued firing in an adjacent neighbourhood – an area, he claimed, that was not covered by the truce. Nonetheless, it is that Israeli fire that appeared to have hastened the Hamas fighters' return to hostilities.\n\nAs the regular thud of explosions resumed, three Palestinian fighters – carrying AK-47s, and with their faces wrapped in scarves – jogged along the street. Other militants were seen sheltering in the buildings. Shujai'iya residents said the heavy shelling began around midnight as tanks and soldiers reached the edge of their neighbourhood – a fierce gun battle followed.\n\nIn the first hours of shelling, it was too dangerous for ambulances to approach – residents were faced with a choice: stay and risk being killed while sheltering at home, or make a run for it and risk being caught in the crossfire.\n\nThose who decided to flee started moving at dawn, when Shujai'iya was still under heavy Israeli tank and mortar fire. They hurried past the corpses in the street, some carried their frightened children, most with only the clothes they had escaped in – several barefoot.\n\nAmong the 30,000 who fled were Sabreen Hattad, 34, and her three children.\n\n\"The Israeli shells were hitting the house. We stayed the night because we were so scared but at about 6am, we decided to escape.\n\n\"But where are we supposed to go? The ambulances could not enter and so we ran under shell fire.\"\n\nThree men rushed past, clutching bedding. Asked what they had seen they replied only: \"Death and horror.\" The sound of small-arms fire rattled from the direction they had come.\n\nMany of those who fled Shujai'iya headed for Gaza City's Shifa hospital, which was engulfed in chaos. Ambulances that had finally and briefly been given access to the site of the carnage sped in steadily, ferrying the dead – among them a local TV cameraman, Khaled Hamad, who was killed during the overnight offensive alongside a paramedic.\n\nAt the morgue, dozens crowded the entrance demanding to be let in to look for missing relatives – and too often found them.\n\nInside the hospital, the staff put mattresses on floors to accommodate the injured, while other patients were evacuated. Nurses carefully placed Aish Ijla, 38, on a mattress in a corridor. His leg had been broken by shrapnel.\n\n\"When the shells started we couldn't leave the house – 30 of us. The shells were hitting the upper floor so we all moved downstairs. Then the shrapnel started hitting our door.\n\n\"It became quiet for a moment and we decided we should run. But as we were on the road a shell landed near me, breaking my leg. I told my family to go on with out me. I carried on – stopping, then limping. Two hours later, an ambulance reached me .\"\n\nArye Shalicar, a spokesman for the Israeli military, told the Guardian that Shujai'iya was a \"frontline base\" for Hamas fighters: \"140 rockets have been launched from there in the last week and a half alone. And [there are] not only rockets but tunnels.\n\n\"We asked the population to evacuate to other neighbourhoods. If we were not bothered about civilians we would have just bombed from the air rather than sending in tanks and soldiers, dozens of whom have been wounded.\"\n\nHamas fighters may be based in Shujai'iya and rockets fired from its streets, but it is also the most densely populated residential neighbourhood in Gaza City. Many homes have been targeted.\n\nThe injured were still being brought to Shifa hospital on Sunday evening. Two young girls arrived, one with a bleeding head wound, another with her teeth smashed out, covered in dust. Another man had lost most of his face.\n\nNaser Tattar, the hospital's director, said at least 17 children, 14 women and four elderly were among the 67 killed in the Israeli assault. About 400 more were wounded. The medical director, Dr Mohammad El Ron, stood in the casualty department, exhausted: \"Most of the casualties brought in so far have been dead.\"",
                "title": "Israel kills scores in Gaza City suburb in deadliest assault of offensive so far",
                "updated_at": {
                    "$date": "2014-08-05T19:43:58.052-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:43:58.980-0400"
                },
                "ext_url": "http://www.theguardian.com/world/2014/jul/20/israel-soldiers-killed-hamas-battle-gaza",
                "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/20/1405893340712/Israeli-soldiers-011.jpg",
                "text": "The Israeli military suffered one of its worst combat days on Sunday, with the death of at least 13 troops in battle and an unconfirmed claim from Hamas that it had kidnapped a soldier inside Gaza.\n\nThe Israel Defence Forces (IDF) said they were investigating Hamas's kidnap claim. Speaking on a Hamas television station, a masked spokesman, Abu Ubaida, said: \"We have captured a Zionist soldier and the occupation has not admitted that.\"\n\nThe claim came after a seven-hour battle between Israeli troops and Hamas fighters in the neighbourhood of Shujai'iya, the first of further confrontations in the coming days, according to a senior Israeli military source.\n\nIDF soldiers encountered a sophisticated, disciplined, brave, highly trained and well-equipped army of militants, he said.\n\n\"We have to admit we were facing good fighters, very well equipped with sophisticated weapons systems, accurate weapons, heavy weapons including mortars, booby traps.\n\n\"It was very difficult fighting,\" the Israeli source said. \"It's very difficult for us to surprise them. They were simply waiting for us.\"\n\nMost of the Hamas fighters had been trained in Iran, he said. \"We can trace the methods,\" he said, referring to the tactics of embedding into densely populated areas for protection. \"We've seen the same with Hezbollah [in Lebanon].\"\n\nBut, he added: \"We've learned lessons, and we'll do better tonight and in the coming nights.\" Israeli troops were still on the ground in Shujai'iya, although in control was \"not the exact term\".\n\nThe official, speaking at the IDF's headquarters in Tel Aviv, warned that similar battles were to be expected in the coming days in pursuit of its goal of locating and destroying tunnels used by militants to launch attacks against Israel.\n\nMany tunnel entrances had been found in Shujai'iya, which he described as a \"stronghold of Hamas\", in the course of Sunday's battle. The IDF has discovered about 15 tunnels since the start of the ground operation but there were many more than initially expected, said the official.\n\nHe described it as a \"very sophisticated network within Gaza and into Israel\", with multiple entrances, shafts and offshoots.\n\nThe IDF had used robots to destroy tunnels as well as conventional methods, he said, adding that the decision to give advance warning to civilians in Gaza of impending operations gave a clear indication to Hamas of Israel's military intentions.\n\nLeaflets and text messages had given the residents of Shujai'iya at least two days' warning to leave their homes by a specific deadline, with instructions about which streets marked a safe area, the source said.\n\n\"They didn't leave because of threats from Hamas,\" he said. \"So many civilian casualties is bad but that's what Hamas wanted us to face, the civilian human shield.\"\n\nAlthough the official said he would like to see a ceasefire, he conceded it would be difficult for Israel now to abandon its stated goal of locating and destroying cross-border tunnels.\n\n\"It can take days, but I hope it won't take more than that,\" he said. \"We have still green light [from the politicians], we have a mission, we are going to fulfil it. We have as much force to open as many fronts as we need.\"",
                "title": "Israeli soldiers killed after battle in Gaza City suburb",
                "updated_at": {
                    "$date": "2014-08-05T19:43:58.980-0400"
                }
            },
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:44:01.749-0400"
                },
                "ext_url": "http://www.un.org/apps/news/story.asp?NewsID=48310#.U808CvldUj4",
                "image": "http://static.un.org/News/dh/photos/large/2014/July/BanAbbas07202014.jpg",
                "text": "20 July 2014 \u0096 The Security Council on Sunday called for an immediate ceasefire in Gaza, as Secretary-General Ban Ki-moon met with Qatar's Emir Sheikh Tamim bin Hamad al-Thani and Palestinian President Mahmoud Abbas in Doha, the first leg of a Middle East tour which aims to end the conflict.\n\nFollowing a late-night closed-door meeting, Ambassador Eugene Richard Gasana of Rwanda, which holds the Security Council's rotating presidency for July, told reporters that the Council had a “sober” meeting given the seriousness of the situation.\n\nIn elements to the press, Mr. Gasana said the members of the Council called for an immediate ceasefire and respect of international humanitarian law, including the protection of civilians.\n\nThe 15-member Council also emphasized the need to improve the humanitarian situation, including through humanitarian pauses, such as the five-hour truce brokered last week by the Secretary-General's Special Coordinator for the Middle East Peace Process, Robert Serry.\n\nMeanwhile, Secretary-General Ban Ki-moon is in the region as part of a visit which aims to express solidarity with Israelis and Palestinians and help bring about a ceasefire.\n\n“As I travel the region, I will continue to press for an [immediate] ceasefire – an immediate end to the Israeli military operation in Gaza and the rocket fire by Hamas and Islamic Jihad,” Mr. Ban said earlier in the day at a press conference alongside Qatari Foreign Minister Khaled al-Attiya.\n\nHe reiterated his demand that all sides respect international humanitarian law and put and stop the ongoing violence.\n\n“While I was en route to Doha, dozens more civilians, including children, have been killed in Israeli military strikes in the Shejaiyah neighborhood in Gaza,” Mr. Ban said. “I condemn this atrocious action. Israel must exercise maximum restraint and do far more to protect civilians.”\n\nAccording to media reports, at least 60 Palestinians and 13 Israeli Defence Forces were killed today in what is being called the bloodiest fighting to date in the nearly two-week offensive.\n\nThe UN Relief and Works Agency for Palestine Refugees in the Near East (UNWRA) said that 81,000 displaced people had now taken refuge in 61 UNRWA shelters in Gaza.\n\n“This figure far exceeds the number seeking refuge with us in the 2008/9 conflict and it is continuing to rise,” UNRWA spokesperson Chris Gunness said in an emailed statement.\n\nMr. Ban and other senior UN officials have repeatedly said that the only way to avoid the cycle of violence and the perpetual insecurity in the region can be to address the root causes of the conflict.\n\nThey have also urged a return to the negotiating table and talks for a two-State solution.\n\n“Israelis, but also Palestinians, need to feel a sense of security,” Mr. Ban said at today's press conference. “Palestinians, but also Israelis, need to see a horizon of hope.”\n\nThe UN chief had been studying a request by Mr. Abbas which would place Palestine under an international protection system administered by the UN, according to the UN's top political official, Jeffrey Feltman.\n\nDuring the press conference, Mr. Ban said that he looked forward to the meeting with Mr. Abbas which would “continue our discussions and find the way to peace.”\n\nMr. Ban heads next to Kuwait City, followed by Cairo, Jerusalem, Ramallah and Amman before returning to New York by the end of the week, according to his spokesperson.\n\nMr. Ban has said he may change his schedule to visit “some other countries wherever I need to be.”",
                "title": "Security Council holds emergency meeting on Gaza; Ban meets with Abbas in Qatar",
                "updated_at": {
                    "$date": "2014-08-05T19:44:01.749-0400"
                }
            }
        ],
        "title": "Thirteen Israeli soldiers, scores of Palestinians killed in deadly day of fighting in Gaza Strip"
    },
    {
        "_id": {
            "$oid": "53e167912c243f694e1c5fe4"
        },
        "articles": [
            {
                "authors": [],
                "created_at": {
                    "$date": "2014-08-05T19:44:26.069-0400"
                },
                "ext_url": "http://www.bbc.com/news/world-middle-east-28399292",
                "image": "http://news.bbcimg.co.uk/media/images/76425000/jpg/_76425812_76425811.jpg",
                "text": "At least five people have been killed and 70 injured by an Israeli strike on a hospital in Gaza, Palestinians say.\n\nThe Israeli military said it had targeted a cache of anti-tank missiles in the hospital's \"immediate vicinity\".\n\nMeanwhile, Secretary of State John Kerry said the US was sending $47m (£28m) in humanitarian aid to Gaza.\n\nOn Monday evening Israel said seven of its soldiers had been killed in the past 24 hours, bringing the number of Israeli military dead to 25.\n\nTwo Israeli civilians have also died in the recent violence.\n\nThe Palestinian death toll from the two-week conflict has now passed 560, the majority of them civilians, according to Gaza's health ministry. The UN says more than 100,000 Gazans have now been displaced.\n\nMonday's attacks across Gaza killed at least 56 people including 16 children, Gazan health officials said.\n\nIsrael says it has killed more than 170 militants since Thursday night, when it launched the ground offensive phase of its two-week old operation to end rocket fire from Gaza.\n\nTen militants were killed on Monday after using tunnels to get into Israel near the town of Sderot.\n\nPalestinian television showed footage of wounded people being treated after the strike at the Al-Aqsa Hospital in Deir al-Balah in the central Gaza Strip.\n\nDoctors say several Israeli tank shells hit the hospital's reception, intensive care unit and operating theatres.\n\nMost of the wounded were doctors, according to Palestinian officials.\n\nAppeals have been made to the Red Cross to help evacuate patients from the building, the BBC's Yolande Knell reports from Gaza.\n\nIsrael had told residents of neighbouring areas to head to Deir al-Balah for their own safety as its ground offensive continues to target neighbourhoods to the east of Gaza City for a second day, our correspondent adds.\n\nThe Israeli army said it had \"successfully targeted\" a cache of anti-tank missiles in the area.\n\n\"Civilian casualties are a tragic inevitability of [Hamas'] brutal and systematic exploitation of homes, hospitals and mosques in Gaza,\" it said in a statement.\n\nIsrael says that approximately 131 rockets and mortars were fired at Israel on Monday, of which at least 108 hit Israel and 17 were intercepted. No casualties were reported from these attacks.\n\nIn Egypt, US Secretary of State John Kerry held talks with UN Secretary General Ban Ki-moon to try to arrange a ceasefire.\n\nMr Kerry said the US is concerned about the safety of Palestinian civilians, but lent his support to Israel's offensive, saying: \"No country can stand by while rockets are attacking it.\"\n\nHe said the US would send $47m (£28m) in aid to Gaza \"to try to alleviate some of the immediate humanitarian crisis\" while continuing efforts to reach a ceasefire deal with both sides.\n\nThe UN Security Council has issued a call for an \"immediate cessation of hostilities\", but did not endorse a strongly worded draft resolution backed by Arab states.\n\nHowever, senior Hamas leader Ismail Haniyeh said that any ceasefire which did not address the question of the Israeli-Egyptian blockade on the territory would not be accepted.\n\n\"This siege, this unjust siege, must be lifted,\" he said.\n\nAnalysis from the BBC's Lyse Doucet in Gaza\n\nThe UN says 43% of Gaza is now \"affected by evacuation warnings\" or declared a \"no-go area\". In the past four days, the numbers seeking shelter in UN-run schools shot up by 400%.\n\nThe UN is running out of supplies, morgues run out of space, and hospital wards are packed.\n\nAs the days go by, there's a sad familiar choreography to Gaza's recurrent wars. As the news gets grimmer, the demands mount for an urgent ceasefire.\n\nAnd as the chorus of concern grows, both sides know their time may be running out, so military operations escalate, and the human cost deepens.\n\nMore sirens were heard today in Tel Aviv, as rockets fired by Hamas from Gaza target Israeli towns and cities.\n\nCompared to the state-of-the-art weapons Israel is using to bombard Gaza, this is a relatively unsophisticated assault. But the rockets spread fear, and pose a real threat to the security of Israeli citizens.\n\nIsrael does have its Iron Dome missile defence system. I watched today as one missile battery shot down several incoming rockets fired by Hamas.\n\nBut the Palestinian militant group has also begun attacking Israel on the ground. For the second time in a few days, militants used a tunnel dug under the border to infiltrate Israeli territory.\n\nDiplomatic efforts to end the fighting are intensifying, but there is a mood in Israel of grim determination.\n\nPalestinian emergency services spokesman Ashraf al-Qudra said nine members of one family were killed in overnight Israeli attacks on Rafah, on the border with Egypt.\n\nIn Khan Younis, in the south of Gaza, at least 23 members of one family died when a building was hit by an Israeli air strike, officials said.\n\nAt least 11 people were reported killed in Gaza City in a strike on a high-rise tower.\n\nIsrael sent ground troops into Gaza after days of heavy air and naval barrages failed to stop rocket fire.\n\nIsrael says the ground operation is necessary to target Hamas' network of tunnels, which have been used by militants to get into Israel and carry out attacks.\n\nBut the UN, Palestinians and Arab states have expressed alarm at the number of civilian casualties.",
                "title": "Gaza conflict: Five dead at hospital hit by Israeli strike",
                "updated_at": {
                    "$date": "2014-08-05T19:44:26.069-0400"
                }
            }
        ],
        "title": "The fighting in Gaza continues at a great cost to both sides"
    }
]